ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
##############################################################

tinypico.name=UM TinyPICO

tinypico.bootloader.tool=esptool_py
tinypico.bootloader.tool.default=esptool_py

tinypico.upload.tool=esptool_py
tinypico.upload.tool.default=esptool_py
tinypico.upload.tool.network=esp_ota

tinypico.upload.maximum_size=1310720
tinypico.upload.maximum_data_size=327680
tinypico.upload.flags=
tinypico.upload.extra_flags=

tinypico.serial.disableDTR=true
tinypico.serial.disableRTS=true

tinypico.build.tarch=xtensa
tinypico.build.bootloader_addr=0x1000
tinypico.build.target=esp32
tinypico.build.mcu=esp32
tinypico.build.core=esp32
tinypico.build.variant=um_tinypico
tinypico.build.board=TINYPICO

tinypico.build.f_cpu=240000000L
tinypico.build.flash_size=4MB
tinypico.build.flash_freq=80m
tinypico.build.flash_mode=dio
tinypico.build.boot=dio
tinypico.build.partitions=default
tinypico.build.defines=

tinypico.menu.PartitionScheme.default=Default
tinypico.menu.PartitionScheme.default.build.partitions=default
tinypico.menu.PartitionScheme.no_ota=No OTA (Large APP)
tinypico.menu.PartitionScheme.no_ota.build.partitions=no_ota
tinypico.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
tinypico.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
tinypico.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
tinypico.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

tinypico.menu.UploadSpeed.921600=921600
tinypico.menu.UploadSpeed.921600.upload.speed=921600
tinypico.menu.UploadSpeed.115200=115200
tinypico.menu.UploadSpeed.115200.upload.speed=115200
tinypico.menu.UploadSpeed.256000.windows=256000
tinypico.menu.UploadSpeed.256000.upload.speed=256000
tinypico.menu.UploadSpeed.230400.windows.upload.speed=256000
tinypico.menu.UploadSpeed.230400=230400
tinypico.menu.UploadSpeed.230400.upload.speed=230400
tinypico.menu.UploadSpeed.460800.linux=460800
tinypico.menu.UploadSpeed.460800.macosx=460800
tinypico.menu.UploadSpeed.460800.upload.speed=460800
tinypico.menu.UploadSpeed.512000.windows=512000
tinypico.menu.UploadSpeed.512000.upload.speed=512000

tinypico.menu.FlashMode.qio=QIO
tinypico.menu.FlashMode.qio.build.flash_mode=dio
tinypico.menu.FlashMode.qio.build.boot=qio
tinypico.menu.FlashMode.dio=DIO
tinypico.menu.FlashMode.dio.build.flash_mode=dio
tinypico.menu.FlashMode.dio.build.boot=dio

tinypico.menu.FlashFreq.80=80MHz
tinypico.menu.FlashFreq.80.build.flash_freq=80m
tinypico.menu.FlashFreq.40=40MHz
tinypico.menu.FlashFreq.40.build.flash_freq=40m

tinypico.menu.PSRAM.enabled=Enabled
tinypico.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
tinypico.menu.PSRAM.enabled.build.extra_libs=
tinypico.menu.PSRAM.disabled=Disabled
tinypico.menu.PSRAM.disabled.build.defines=
tinypico.menu.PSRAM.disabled.build.extra_libs=

tinypico.menu.DebugLevel.none=None
tinypico.menu.DebugLevel.none.build.code_debug=0
tinypico.menu.DebugLevel.error=Error
tinypico.menu.DebugLevel.error.build.code_debug=1
tinypico.menu.DebugLevel.warn=Warn
tinypico.menu.DebugLevel.warn.build.code_debug=2
tinypico.menu.DebugLevel.info=Info
tinypico.menu.DebugLevel.info.build.code_debug=3
tinypico.menu.DebugLevel.debug=Debug
tinypico.menu.DebugLevel.debug.build.code_debug=4
tinypico.menu.DebugLevel.verbose=Verbose
tinypico.menu.DebugLevel.verbose.build.code_debug=5

tinypico.menu.EraseFlash.none=Disabled
tinypico.menu.EraseFlash.none.upload.erase_cmd=
tinypico.menu.EraseFlash.all=Enabled
tinypico.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
tinys3.name=UM TinyS3
tinys3.vid.0=0x303a
tinys3.pid.0=0x80D0

tinys3.bootloader.tool=esptool_py
tinys3.bootloader.tool.default=esptool_py

tinys3.upload.tool=esptool_py
tinys3.upload.tool.default=esptool_py
tinys3.upload.tool.network=esp_ota

tinys3.upload.maximum_size=1310720
tinys3.upload.maximum_data_size=327680
tinys3.upload.flags=
tinys3.upload.extra_flags=
tinys3.upload.use_1200bps_touch=false
tinys3.upload.wait_for_upload_port=false

tinys3.serial.disableDTR=false
tinys3.serial.disableRTS=false

tinys3.build.tarch=xtensa
tinys3.build.bootloader_addr=0x0
tinys3.build.target=esp32s3
tinys3.build.mcu=esp32s3
tinys3.build.core=esp32
tinys3.build.variant=um_tinys3
tinys3.build.board=TINYS3

tinys3.build.usb_mode=1
tinys3.build.cdc_on_boot=0
tinys3.build.msc_on_boot=0
tinys3.build.dfu_on_boot=0
tinys3.build.f_cpu=240000000L
tinys3.build.flash_size=8MB
tinys3.build.flash_freq=80m
tinys3.build.flash_mode=dio
tinys3.build.boot=qio
tinys3.build.partitions=default
tinys3.build.defines=
tinys3.build.loop_core=
tinys3.build.event_core=
tinys3.build.flash_type=qio
tinys3.build.psram_type=qspi
tinys3.build.memory_type=qio_qspi

tinys3.menu.LoopCore.1=Core 1
tinys3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
tinys3.menu.LoopCore.0=Core 0
tinys3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

tinys3.menu.EventsCore.1=Core 1
tinys3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
tinys3.menu.EventsCore.0=Core 0
tinys3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

tinys3.menu.USBMode.default=USB-OTG (TinyUSB)
tinys3.menu.USBMode.default.build.usb_mode=0
tinys3.menu.USBMode.hwcdc=Hardware CDC and JTAG
tinys3.menu.USBMode.hwcdc.build.usb_mode=1

tinys3.menu.CDCOnBoot.cdc=Enabled
tinys3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
tinys3.menu.CDCOnBoot.default=Disabled
tinys3.menu.CDCOnBoot.default.build.cdc_on_boot=0

tinys3.menu.MSCOnBoot.default=Disabled
tinys3.menu.MSCOnBoot.default.build.msc_on_boot=0
tinys3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
tinys3.menu.MSCOnBoot.msc.build.msc_on_boot=1

tinys3.menu.DFUOnBoot.default=Disabled
tinys3.menu.DFUOnBoot.default.build.dfu_on_boot=0
tinys3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
tinys3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

tinys3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
tinys3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
tinys3.menu.UploadMode.cdc.upload.wait_for_upload_port=true
tinys3.menu.UploadMode.default=UART0 / Hardware CDC
tinys3.menu.UploadMode.default.upload.use_1200bps_touch=false
tinys3.menu.UploadMode.default.upload.wait_for_upload_port=false

tinys3.menu.PSRAM.enabled=Enabled
tinys3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
tinys3.menu.PSRAM.disabled=Disabled
tinys3.menu.PSRAM.disabled.build.defines=

tinys3.menu.PartitionScheme.default_8MB=Default (3MB APP/1.5MB SPIFFS)
tinys3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
tinys3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
tinys3.menu.PartitionScheme.tinyuf2=TinyUF2 Compatibility (2MB APP/3.7MB FFAT)
tinys3.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader_tinyuf2
tinys3.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions_tinyuf2
tinys3.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
tinys3.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152

