ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
lilygo_t_display_s3.menu.LoopCore.1=Core 1
lilygo_t_display_s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
lilygo_t_display_s3.menu.LoopCore.0=Core 0
lilygo_t_display_s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

lilygo_t_display_s3.menu.EventsCore.1=Core 1
lilygo_t_display_s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
lilygo_t_display_s3.menu.EventsCore.0=Core 0
lilygo_t_display_s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

lilygo_t_display_s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
lilygo_t_display_s3.menu.USBMode.hwcdc.build.usb_mode=1
lilygo_t_display_s3.menu.USBMode.default=USB-OTG (TinyUSB)
lilygo_t_display_s3.menu.USBMode.default.build.usb_mode=0

lilygo_t_display_s3.menu.CDCOnBoot.cdc=Enabled
lilygo_t_display_s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
lilygo_t_display_s3.menu.CDCOnBoot.default=Disabled
lilygo_t_display_s3.menu.CDCOnBoot.default.build.cdc_on_boot=0

lilygo_t_display_s3.menu.MSCOnBoot.default=Disabled
lilygo_t_display_s3.menu.MSCOnBoot.default.build.msc_on_boot=0
lilygo_t_display_s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
lilygo_t_display_s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

lilygo_t_display_s3.menu.DFUOnBoot.default=Disabled
lilygo_t_display_s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
lilygo_t_display_s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
lilygo_t_display_s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

lilygo_t_display_s3.menu.UploadMode.default=UART0 / Hardware CDC
lilygo_t_display_s3.menu.UploadMode.default.upload.use_1200bps_touch=false
lilygo_t_display_s3.menu.UploadMode.default.upload.wait_for_upload_port=false
lilygo_t_display_s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
lilygo_t_display_s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
lilygo_t_display_s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

lilygo_t_display_s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
lilygo_t_display_s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
lilygo_t_display_s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
lilygo_t_display_s3.menu.PartitionScheme.rainmaker=RainMaker
lilygo_t_display_s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
lilygo_t_display_s3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

lilygo_t_display_s3.menu.DebugLevel.none=None
lilygo_t_display_s3.menu.DebugLevel.none.build.code_debug=0
lilygo_t_display_s3.menu.DebugLevel.error=Error
lilygo_t_display_s3.menu.DebugLevel.error.build.code_debug=1
lilygo_t_display_s3.menu.DebugLevel.warn=Warn
lilygo_t_display_s3.menu.DebugLevel.warn.build.code_debug=2
lilygo_t_display_s3.menu.DebugLevel.info=Info
lilygo_t_display_s3.menu.DebugLevel.info.build.code_debug=3
lilygo_t_display_s3.menu.DebugLevel.debug=Debug
lilygo_t_display_s3.menu.DebugLevel.debug.build.code_debug=4
lilygo_t_display_s3.menu.DebugLevel.verbose=Verbose
lilygo_t_display_s3.menu.DebugLevel.verbose.build.code_debug=5

lilygo_t_display_s3.menu.EraseFlash.none=Disabled
lilygo_t_display_s3.menu.EraseFlash.none.upload.erase_cmd=
lilygo_t_display_s3.menu.EraseFlash.all=Enabled
lilygo_t_display_s3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

magicbit.name=MagicBit

magicbit.bootloader.tool=esptool_py
magicbit.bootloader.tool.default=esptool_py

magicbit.upload.tool=esptool_py
magicbit.upload.tool.default=esptool_py
magicbit.upload.tool.network=esp_ota

magicbit.upload.maximum_size=1310720
magicbit.upload.maximum_data_size=327680
magicbit.upload.flags=
magicbit.upload.extra_flags=

magicbit.serial.disableDTR=true
magicbit.serial.disableRTS=true

magicbit.build.tarch=xtensa
magicbit.build.bootloader_addr=0x1000
magicbit.build.target=esp32
magicbit.build.mcu=esp32
magicbit.build.core=esp32
magicbit.build.variant=magicbit
magicbit.build.board=ESP32_DEV

magicbit.build.f_cpu=240000000L
magicbit.build.flash_size=4MB
magicbit.build.flash_freq=40m
magicbit.build.flash_mode=dio
magicbit.build.boot=dio
magicbit.build.partitions=default

magicbit.menu.CPUFreq.240=240MHz (WiFi/BT)
magicbit.menu.CPUFreq.240.build.f_cpu=240000000L
magicbit.menu.CPUFreq.160=160MHz (WiFi/BT)
magicbit.menu.CPUFreq.160.build.f_cpu=160000000L
magicbit.menu.CPUFreq.80=80MHz (WiFi/BT)
magicbit.menu.CPUFreq.80.build.f_cpu=80000000L
magicbit.menu.CPUFreq.40=40MHz (40MHz XTAL)

magicbit.menu.UploadSpeed.921600=921600
magicbit.menu.UploadSpeed.921600.upload.speed=921600
magicbit.menu.UploadSpeed.115200=115200
magicbit.menu.UploadSpeed.115200.upload.speed=115200

magicbit.menu.DebugLevel.none=None
magicbit.menu.DebugLevel.none.build.code_debug=0
magicbit.menu.DebugLevel.error=Error
magicbit.menu.DebugLevel.error.build.code_debug=1
magicbit.menu.DebugLevel.warn=Warn
magicbit.menu.DebugLevel.warn.build.code_debug=2
magicbit.menu.DebugLevel.info=Info
magicbit.menu.DebugLevel.info.build.code_debug=3
magicbit.menu.DebugLevel.debug=Debug
magicbit.menu.DebugLevel.debug.build.code_debug=4
magicbit.menu.DebugLevel.verbose=Verbose
magicbit.menu.DebugLevel.verbose.build.code_debug=5

magicbit.menu.EraseFlash.none=Disabled
magicbit.menu.EraseFlash.none.upload.erase_cmd=
magicbit.menu.EraseFlash.all=Enabled
magicbit.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

turta_iot_node.name=Turta IoT Node

turta_iot_node.bootloader.tool=esptool_py
turta_iot_node.bootloader.tool.default=esptool_py

turta_iot_node.upload.tool=esptool_py
turta_iot_node.upload.tool.default=esptool_py
turta_iot_node.upload.tool.network=esp_ota

turta_iot_node.upload.maximum_size=1310720
turta_iot_node.upload.maximum_data_size=327680
turta_iot_node.upload.flags=
turta_iot_node.upload.extra_flags=

turta_iot_node.serial.disableDTR=true
turta_iot_node.serial.disableRTS=true

turta_iot_node.build.tarch=xtensa
turta_iot_node.build.bootloader_addr=0x1000
turta_iot_node.build.target=esp32
turta_iot_node.build.mcu=esp32
turta_iot_node.build.core=esp32
turta_iot_node.build.variant=pico32
turta_iot_node.build.board=ESP32_PICO

turta_iot_node.build.f_cpu=240000000L
turta_iot_node.build.flash_size=4MB
turta_iot_node.build.flash_freq=80m
turta_iot_node.build.flash_mode=dio
turta_iot_node.build.boot=dio
turta_iot_node.build.partitions=default
turta_iot_node.build.defines=

turta_iot_node.menu.UploadSpeed.921600=921600
turta_iot_node.menu.UploadSpeed.921600.upload.speed=921600
turta_iot_node.menu.UploadSpeed.115200=115200
turta_iot_node.menu.UploadSpeed.115200.upload.speed=115200

