ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
dfrobot_firebeetle2_esp32s3.menu.FlashSize.4M=4MB (32Mb)
dfrobot_firebeetle2_esp32s3.menu.FlashSize.4M.build.flash_size=4MB
dfrobot_firebeetle2_esp32s3.menu.FlashSize.8M=8MB (64Mb)
dfrobot_firebeetle2_esp32s3.menu.FlashSize.8M.build.flash_size=8MB
dfrobot_firebeetle2_esp32s3.menu.FlashSize.8M.build.partitions=default_8MB
dfrobot_firebeetle2_esp32s3.menu.FlashSize.16M=16MB (128Mb)
dfrobot_firebeetle2_esp32s3.menu.FlashSize.16M.build.flash_size=16MB
#dfrobot_firebeetle2_esp32s3.menu.FlashSize.32M=32MB (256Mb)
#dfrobot_firebeetle2_esp32s3.menu.FlashSize.32M.build.flash_size=32MB

dfrobot_firebeetle2_esp32s3.menu.LoopCore.1=Core 1
dfrobot_firebeetle2_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
dfrobot_firebeetle2_esp32s3.menu.LoopCore.0=Core 0
dfrobot_firebeetle2_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

dfrobot_firebeetle2_esp32s3.menu.EventsCore.1=Core 1
dfrobot_firebeetle2_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
dfrobot_firebeetle2_esp32s3.menu.EventsCore.0=Core 0
dfrobot_firebeetle2_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

dfrobot_firebeetle2_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
dfrobot_firebeetle2_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1
dfrobot_firebeetle2_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
dfrobot_firebeetle2_esp32s3.menu.USBMode.default.build.usb_mode=0

dfrobot_firebeetle2_esp32s3.menu.CDCOnBoot.default=Disabled
dfrobot_firebeetle2_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0
dfrobot_firebeetle2_esp32s3.menu.CDCOnBoot.cdc=Enabled
dfrobot_firebeetle2_esp32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

dfrobot_firebeetle2_esp32s3.menu.MSCOnBoot.default=Disabled
dfrobot_firebeetle2_esp32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
dfrobot_firebeetle2_esp32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
dfrobot_firebeetle2_esp32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

dfrobot_firebeetle2_esp32s3.menu.DFUOnBoot.default=Disabled
dfrobot_firebeetle2_esp32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
dfrobot_firebeetle2_esp32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
dfrobot_firebeetle2_esp32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

dfrobot_firebeetle2_esp32s3.menu.UploadMode.default=UART0 / Hardware CDC
dfrobot_firebeetle2_esp32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
dfrobot_firebeetle2_esp32s3.menu.UploadMode.default.upload.wait_for_upload_port=false
dfrobot_firebeetle2_esp32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
dfrobot_firebeetle2_esp32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
dfrobot_firebeetle2_esp32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.default.build.partitions=default
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.minimal.build.partitions=minimal
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.fatflash.build.partitions=ffat
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.rainmaker=RainMaker
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
dfrobot_firebeetle2_esp32s3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

dfrobot_firebeetle2_esp32s3.menu.CPUFreq.240=240MHz (WiFi)
dfrobot_firebeetle2_esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
dfrobot_firebeetle2_esp32s3.menu.CPUFreq.160=160MHz (WiFi)
dfrobot_firebeetle2_esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
dfrobot_firebeetle2_esp32s3.menu.CPUFreq.80=80MHz (WiFi)
dfrobot_firebeetle2_esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
dfrobot_firebeetle2_esp32s3.menu.CPUFreq.40=40MHz
dfrobot_firebeetle2_esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
dfrobot_firebeetle2_esp32s3.menu.CPUFreq.20=20MHz
dfrobot_firebeetle2_esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
dfrobot_firebeetle2_esp32s3.menu.CPUFreq.10=10MHz
dfrobot_firebeetle2_esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.921600=921600
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.921600.upload.speed=921600
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.115200=115200
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.115200.upload.speed=115200
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.256000.windows=256000
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.256000.upload.speed=256000
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.230400=230400
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.230400.upload.speed=230400
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.460800.linux=460800
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.460800.macosx=460800
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.460800.upload.speed=460800
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.512000.windows=512000
dfrobot_firebeetle2_esp32s3.menu.UploadSpeed.512000.upload.speed=512000

