ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
##############################################################

onehorse32dev.name=Onehorse ESP32 Dev Module

onehorse32dev.bootloader.tool=esptool_py
onehorse32dev.bootloader.tool.default=esptool_py

onehorse32dev.upload.tool=esptool_py
onehorse32dev.upload.tool.default=esptool_py
onehorse32dev.upload.tool.network=esp_ota

onehorse32dev.upload.maximum_size=1310720
onehorse32dev.upload.maximum_data_size=327680
onehorse32dev.upload.flags=
onehorse32dev.upload.extra_flags=

onehorse32dev.serial.disableDTR=true
onehorse32dev.serial.disableRTS=true

onehorse32dev.build.tarch=xtensa
onehorse32dev.build.bootloader_addr=0x1000
onehorse32dev.build.target=esp32
onehorse32dev.build.mcu=esp32
onehorse32dev.build.core=esp32
onehorse32dev.build.variant=onehorse32dev
onehorse32dev.build.board=ONEHORSE_ESP32_DEV

onehorse32dev.build.f_cpu=240000000L
onehorse32dev.build.flash_mode=dout
onehorse32dev.build.flash_size=4MB
onehorse32dev.build.boot=dio
onehorse32dev.build.partitions=default
onehorse32dev.build.defines=

onehorse32dev.menu.FlashFreq.80=80MHz
onehorse32dev.menu.FlashFreq.80.build.flash_freq=80m
onehorse32dev.menu.FlashFreq.40=40MHz
onehorse32dev.menu.FlashFreq.40.build.flash_freq=40m

onehorse32dev.menu.UploadSpeed.921600=921600
onehorse32dev.menu.UploadSpeed.921600.upload.speed=921600
onehorse32dev.menu.UploadSpeed.115200=115200
onehorse32dev.menu.UploadSpeed.115200.upload.speed=115200
onehorse32dev.menu.UploadSpeed.256000.windows=256000
onehorse32dev.menu.UploadSpeed.256000.upload.speed=256000
onehorse32dev.menu.UploadSpeed.230400.windows.upload.speed=256000
onehorse32dev.menu.UploadSpeed.230400=230400
onehorse32dev.menu.UploadSpeed.230400.upload.speed=230400
onehorse32dev.menu.UploadSpeed.460800.linux=460800
onehorse32dev.menu.UploadSpeed.460800.macosx=460800
onehorse32dev.menu.UploadSpeed.460800.upload.speed=460800
onehorse32dev.menu.UploadSpeed.512000.windows=512000
onehorse32dev.menu.UploadSpeed.512000.upload.speed=512000

onehorse32dev.menu.DebugLevel.none=None
onehorse32dev.menu.DebugLevel.none.build.code_debug=0
onehorse32dev.menu.DebugLevel.error=Error
onehorse32dev.menu.DebugLevel.error.build.code_debug=1
onehorse32dev.menu.DebugLevel.warn=Warn
onehorse32dev.menu.DebugLevel.warn.build.code_debug=2
onehorse32dev.menu.DebugLevel.info=Info
onehorse32dev.menu.DebugLevel.info.build.code_debug=3
onehorse32dev.menu.DebugLevel.debug=Debug
onehorse32dev.menu.DebugLevel.debug.build.code_debug=4
onehorse32dev.menu.DebugLevel.verbose=Verbose
onehorse32dev.menu.DebugLevel.verbose.build.code_debug=5

onehorse32dev.menu.EraseFlash.none=Disabled
onehorse32dev.menu.EraseFlash.none.upload.erase_cmd=
onehorse32dev.menu.EraseFlash.all=Enabled
onehorse32dev.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit ESP32 Feather

featheresp32.name=Adafruit ESP32 Feather

featheresp32.bootloader.tool=esptool_py
featheresp32.bootloader.tool.default=esptool_py

featheresp32.upload.tool=esptool_py
featheresp32.upload.tool.default=esptool_py
featheresp32.upload.tool.network=esp_ota

featheresp32.upload.maximum_size=1310720
featheresp32.upload.maximum_data_size=327680
featheresp32.upload.flags=
featheresp32.upload.extra_flags=

featheresp32.serial.disableDTR=true
featheresp32.serial.disableRTS=true

featheresp32.build.tarch=xtensa
featheresp32.build.bootloader_addr=0x1000
featheresp32.build.target=esp32
featheresp32.build.mcu=esp32
featheresp32.build.core=esp32
featheresp32.build.variant=feather_esp32
featheresp32.build.board=FEATHER_ESP32

featheresp32.build.f_cpu=240000000L
featheresp32.build.flash_size=4MB
featheresp32.build.flash_freq=80m
featheresp32.build.flash_mode=dio
featheresp32.build.boot=dio
featheresp32.build.partitions=default
featheresp32.build.defines=
featheresp32.build.loop_core=
featheresp32.build.event_core=

featheresp32.menu.LoopCore.1=Core 1
featheresp32.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
featheresp32.menu.LoopCore.0=Core 0
featheresp32.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

featheresp32.menu.EventsCore.1=Core 1
featheresp32.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
featheresp32.menu.EventsCore.0=Core 0
featheresp32.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

featheresp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
featheresp32.menu.PartitionScheme.default.build.partitions=default
featheresp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
featheresp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
featheresp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
featheresp32.menu.PartitionScheme.minimal.build.partitions=minimal
featheresp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
featheresp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
featheresp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
featheresp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
featheresp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
featheresp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
featheresp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
featheresp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
featheresp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
featheresp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
featheresp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
featheresp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
featheresp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
featheresp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
featheresp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
featheresp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
featheresp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
featheresp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

