ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
adafruit_feather_esp32s3.menu.DebugLevel.none=None
adafruit_feather_esp32s3.menu.DebugLevel.none.build.code_debug=0
adafruit_feather_esp32s3.menu.DebugLevel.error=Error
adafruit_feather_esp32s3.menu.DebugLevel.error.build.code_debug=1
adafruit_feather_esp32s3.menu.DebugLevel.warn=Warn
adafruit_feather_esp32s3.menu.DebugLevel.warn.build.code_debug=2
adafruit_feather_esp32s3.menu.DebugLevel.info=Info
adafruit_feather_esp32s3.menu.DebugLevel.info.build.code_debug=3
adafruit_feather_esp32s3.menu.DebugLevel.debug=Debug
adafruit_feather_esp32s3.menu.DebugLevel.debug.build.code_debug=4
adafruit_feather_esp32s3.menu.DebugLevel.verbose=Verbose
adafruit_feather_esp32s3.menu.DebugLevel.verbose.build.code_debug=5

adafruit_feather_esp32s3.menu.EraseFlash.none=Disabled
adafruit_feather_esp32s3.menu.EraseFlash.none.upload.erase_cmd=
adafruit_feather_esp32s3.menu.EraseFlash.all=Enabled
adafruit_feather_esp32s3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit Feather ESP32-S3 No PSRAM

adafruit_feather_esp32s3_nopsram.name=Adafruit Feather ESP32-S3 No PSRAM
adafruit_feather_esp32s3_nopsram.vid.0=0x239A
adafruit_feather_esp32s3_nopsram.pid.0=0x8113
adafruit_feather_esp32s3_nopsram.vid.1=0x239A
adafruit_feather_esp32s3_nopsram.pid.1=0x0113
adafruit_feather_esp32s3_nopsram.vid.2=0x239A
adafruit_feather_esp32s3_nopsram.pid.2=0x8114

adafruit_feather_esp32s3_nopsram.bootloader.tool=esptool_py
adafruit_feather_esp32s3_nopsram.bootloader.tool.default=esptool_py

adafruit_feather_esp32s3_nopsram.upload.tool=esptool_py
adafruit_feather_esp32s3_nopsram.upload.tool.default=esptool_py
adafruit_feather_esp32s3_nopsram.upload.tool.network=esp_ota

adafruit_feather_esp32s3_nopsram.upload.maximum_size=1310720
adafruit_feather_esp32s3_nopsram.upload.maximum_data_size=327680
adafruit_feather_esp32s3_nopsram.upload.flags=
adafruit_feather_esp32s3_nopsram.upload.extra_flags=
adafruit_feather_esp32s3_nopsram.upload.use_1200bps_touch=true
adafruit_feather_esp32s3_nopsram.upload.wait_for_upload_port=true

adafruit_feather_esp32s3_nopsram.serial.disableDTR=false
adafruit_feather_esp32s3_nopsram.serial.disableRTS=false

adafruit_feather_esp32s3_nopsram.build.tarch=xtensa
adafruit_feather_esp32s3_nopsram.build.bootloader_addr=0x0
adafruit_feather_esp32s3_nopsram.build.target=esp32s3
adafruit_feather_esp32s3_nopsram.build.mcu=esp32s3
adafruit_feather_esp32s3_nopsram.build.core=esp32
adafruit_feather_esp32s3_nopsram.build.variant=adafruit_feather_esp32s3_nopsram
adafruit_feather_esp32s3_nopsram.build.board=ADAFRUIT_FEATHER_ESP32S3_NOPSRAM

adafruit_feather_esp32s3_nopsram.build.usb_mode=0
adafruit_feather_esp32s3_nopsram.build.cdc_on_boot=1
adafruit_feather_esp32s3_nopsram.build.msc_on_boot=0
adafruit_feather_esp32s3_nopsram.build.dfu_on_boot=0
adafruit_feather_esp32s3_nopsram.build.f_cpu=240000000L
adafruit_feather_esp32s3_nopsram.build.flash_size=8MB
adafruit_feather_esp32s3_nopsram.build.flash_freq=80m
adafruit_feather_esp32s3_nopsram.build.flash_mode=dio
adafruit_feather_esp32s3_nopsram.build.boot=qio
adafruit_feather_esp32s3_nopsram.build.partitions=default
adafruit_feather_esp32s3_nopsram.build.defines=
adafruit_feather_esp32s3_nopsram.build.loop_core=
adafruit_feather_esp32s3_nopsram.build.event_core=
adafruit_feather_esp32s3_nopsram.build.flash_type=qio
adafruit_feather_esp32s3_nopsram.build.psram_type=qspi
adafruit_feather_esp32s3_nopsram.build.memory_type={build.flash_type}_{build.psram_type}

adafruit_feather_esp32s3_nopsram.menu.LoopCore.1=Core 1
adafruit_feather_esp32s3_nopsram.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_feather_esp32s3_nopsram.menu.LoopCore.0=Core 0
adafruit_feather_esp32s3_nopsram.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_feather_esp32s3_nopsram.menu.EventsCore.1=Core 1
adafruit_feather_esp32s3_nopsram.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_feather_esp32s3_nopsram.menu.EventsCore.0=Core 0
adafruit_feather_esp32s3_nopsram.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_feather_esp32s3_nopsram.menu.USBMode.default=USB-OTG (TinyUSB)
adafruit_feather_esp32s3_nopsram.menu.USBMode.default.build.usb_mode=0
adafruit_feather_esp32s3_nopsram.menu.USBMode.hwcdc=Hardware CDC and JTAG
adafruit_feather_esp32s3_nopsram.menu.USBMode.hwcdc.build.usb_mode=1

adafruit_feather_esp32s3_nopsram.menu.CDCOnBoot.cdc=Enabled
adafruit_feather_esp32s3_nopsram.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_feather_esp32s3_nopsram.menu.CDCOnBoot.default=Disabled
adafruit_feather_esp32s3_nopsram.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_feather_esp32s3_nopsram.menu.MSCOnBoot.default=Disabled
adafruit_feather_esp32s3_nopsram.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_feather_esp32s3_nopsram.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
adafruit_feather_esp32s3_nopsram.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_feather_esp32s3_nopsram.menu.DFUOnBoot.default=Disabled
adafruit_feather_esp32s3_nopsram.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_feather_esp32s3_nopsram.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
adafruit_feather_esp32s3_nopsram.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_feather_esp32s3_nopsram.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
adafruit_feather_esp32s3_nopsram.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_feather_esp32s3_nopsram.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_feather_esp32s3_nopsram.menu.UploadMode.default=UART0 / Hardware CDC
adafruit_feather_esp32s3_nopsram.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_feather_esp32s3_nopsram.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_feather_esp32s3_nopsram.menu.PartitionScheme.tinyuf2=TinyUF2 8MB (2MB APP/3.7MB FFAT)
adafruit_feather_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_feather_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions-8MB-tinyuf2
adafruit_feather_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152
adafruit_feather_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_feather_esp32s3_nopsram.menu.PartitionScheme.default_8MB=Default (3MB APP/1.5MB SPIFFS)
adafruit_feather_esp32s3_nopsram.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
adafruit_feather_esp32s3_nopsram.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336

adafruit_feather_esp32s3_nopsram.menu.CPUFreq.240=240MHz (WiFi)
adafruit_feather_esp32s3_nopsram.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_feather_esp32s3_nopsram.menu.CPUFreq.160=160MHz (WiFi)
adafruit_feather_esp32s3_nopsram.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_feather_esp32s3_nopsram.menu.CPUFreq.80=80MHz (WiFi)
adafruit_feather_esp32s3_nopsram.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_feather_esp32s3_nopsram.menu.CPUFreq.40=40MHz
adafruit_feather_esp32s3_nopsram.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_feather_esp32s3_nopsram.menu.CPUFreq.20=20MHz
adafruit_feather_esp32s3_nopsram.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_feather_esp32s3_nopsram.menu.CPUFreq.10=10MHz
adafruit_feather_esp32s3_nopsram.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_feather_esp32s3_nopsram.menu.FlashMode.qio=QIO 80MHz
adafruit_feather_esp32s3_nopsram.menu.FlashMode.qio.build.flash_mode=dio
adafruit_feather_esp32s3_nopsram.menu.FlashMode.qio.build.boot=qio
adafruit_feather_esp32s3_nopsram.menu.FlashMode.qio.build.boot_freq=80m
adafruit_feather_esp32s3_nopsram.menu.FlashMode.qio.build.flash_freq=80m
adafruit_feather_esp32s3_nopsram.menu.FlashMode.qio120=QIO 120MHz
adafruit_feather_esp32s3_nopsram.menu.FlashMode.qio120.build.flash_mode=dio
adafruit_feather_esp32s3_nopsram.menu.FlashMode.qio120.build.boot=qio
adafruit_feather_esp32s3_nopsram.menu.FlashMode.qio120.build.boot_freq=120m
adafruit_feather_esp32s3_nopsram.menu.FlashMode.qio120.build.flash_freq=80m
adafruit_feather_esp32s3_nopsram.menu.FlashMode.dio=DIO 80MHz
adafruit_feather_esp32s3_nopsram.menu.FlashMode.dio.build.flash_mode=dio
adafruit_feather_esp32s3_nopsram.menu.FlashMode.dio.build.boot=dio
adafruit_feather_esp32s3_nopsram.menu.FlashMode.dio.build.boot_freq=80m
adafruit_feather_esp32s3_nopsram.menu.FlashMode.dio.build.flash_freq=80m
adafruit_feather_esp32s3_nopsram.menu.FlashMode.opi=OPI 80MHz
adafruit_feather_esp32s3_nopsram.menu.FlashMode.opi.build.flash_mode=dout
adafruit_feather_esp32s3_nopsram.menu.FlashMode.opi.build.boot=opi
adafruit_feather_esp32s3_nopsram.menu.FlashMode.opi.build.boot_freq=80m
adafruit_feather_esp32s3_nopsram.menu.FlashMode.opi.build.flash_freq=80m

adafruit_feather_esp32s3_nopsram.menu.FlashSize.8M=8MB (64Mb)
adafruit_feather_esp32s3_nopsram.menu.FlashSize.8M.build.flash_size=8MB

