ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
adafruit_feather_esp32s3_reversetft.menu.LoopCore.1=Core 1
adafruit_feather_esp32s3_reversetft.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_feather_esp32s3_reversetft.menu.LoopCore.0=Core 0
adafruit_feather_esp32s3_reversetft.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_feather_esp32s3_reversetft.menu.EventsCore.1=Core 1
adafruit_feather_esp32s3_reversetft.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_feather_esp32s3_reversetft.menu.EventsCore.0=Core 0
adafruit_feather_esp32s3_reversetft.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_feather_esp32s3_reversetft.menu.USBMode.default=USB-OTG (TinyUSB)
adafruit_feather_esp32s3_reversetft.menu.USBMode.default.build.usb_mode=0
adafruit_feather_esp32s3_reversetft.menu.USBMode.hwcdc=Hardware CDC and JTAG
adafruit_feather_esp32s3_reversetft.menu.USBMode.hwcdc.build.usb_mode=1

adafruit_feather_esp32s3_reversetft.menu.CDCOnBoot.cdc=Enabled
adafruit_feather_esp32s3_reversetft.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_feather_esp32s3_reversetft.menu.CDCOnBoot.default=Disabled
adafruit_feather_esp32s3_reversetft.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_feather_esp32s3_reversetft.menu.MSCOnBoot.default=Disabled
adafruit_feather_esp32s3_reversetft.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_feather_esp32s3_reversetft.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
adafruit_feather_esp32s3_reversetft.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_feather_esp32s3_reversetft.menu.DFUOnBoot.default=Disabled
adafruit_feather_esp32s3_reversetft.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_feather_esp32s3_reversetft.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
adafruit_feather_esp32s3_reversetft.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_feather_esp32s3_reversetft.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
adafruit_feather_esp32s3_reversetft.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_feather_esp32s3_reversetft.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_feather_esp32s3_reversetft.menu.UploadMode.default=UART0 / Hardware CDC
adafruit_feather_esp32s3_reversetft.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_feather_esp32s3_reversetft.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_feather_esp32s3_reversetft.menu.PSRAM.enabled=QSPI PSRAM
adafruit_feather_esp32s3_reversetft.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_feather_esp32s3_reversetft.menu.PSRAM.enabled.build.psram_type=qspi
adafruit_feather_esp32s3_reversetft.menu.PSRAM.disabled=Disabled
adafruit_feather_esp32s3_reversetft.menu.PSRAM.disabled.build.defines=
adafruit_feather_esp32s3_reversetft.menu.PSRAM.disabled.build.psram_type=qspi
adafruit_feather_esp32s3_reversetft.menu.PSRAM.opi=OPI PSRAM
adafruit_feather_esp32s3_reversetft.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
adafruit_feather_esp32s3_reversetft.menu.PSRAM.opi.build.psram_type=opi

adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.tinyuf2=TinyUF2 4MB (1.3MB APP/960KB FFAT)
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions-4MB-tinyuf2
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.tinyuf2.upload.maximum_size=1441792
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.default.build.partitions=default
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_feather_esp32s3_reversetft.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

adafruit_feather_esp32s3_reversetft.menu.CPUFreq.240=240MHz (WiFi)
adafruit_feather_esp32s3_reversetft.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_feather_esp32s3_reversetft.menu.CPUFreq.160=160MHz (WiFi)
adafruit_feather_esp32s3_reversetft.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_feather_esp32s3_reversetft.menu.CPUFreq.80=80MHz (WiFi)
adafruit_feather_esp32s3_reversetft.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_feather_esp32s3_reversetft.menu.CPUFreq.40=40MHz
adafruit_feather_esp32s3_reversetft.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_feather_esp32s3_reversetft.menu.CPUFreq.20=20MHz
adafruit_feather_esp32s3_reversetft.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_feather_esp32s3_reversetft.menu.CPUFreq.10=10MHz
adafruit_feather_esp32s3_reversetft.menu.CPUFreq.10.build.f_cpu=10000000L

