ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio=QIO 80MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.flash_mode=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.boot=qio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.boot_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio.build.flash_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120=QIO 120MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.flash_mode=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.boot=qio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.boot_freq=120m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.qio120.build.flash_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio=DIO 80MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.flash_mode=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.boot=dio
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.boot_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.dio.build.flash_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi=OPI 80MHz
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.flash_mode=dout
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.boot=opi
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.boot_freq=80m
adafruit_feather_esp32s3_reversetft.menu.FlashMode.opi.build.flash_freq=80m

adafruit_feather_esp32s3_reversetft.menu.FlashSize.4M=4MB (32Mb)
adafruit_feather_esp32s3_reversetft.menu.FlashSize.4M.build.flash_size=4MB

adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.921600=921600
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.921600.upload.speed=921600
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.115200=115200
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.115200.upload.speed=115200
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.256000.windows=256000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.256000.upload.speed=256000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.230400=230400
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.230400.upload.speed=230400
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.460800.linux=460800
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.460800.macosx=460800
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.460800.upload.speed=460800
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.512000.windows=512000
adafruit_feather_esp32s3_reversetft.menu.UploadSpeed.512000.upload.speed=512000

adafruit_feather_esp32s3_reversetft.menu.DebugLevel.none=None
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.none.build.code_debug=0
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.error=Error
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.error.build.code_debug=1
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.warn=Warn
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.warn.build.code_debug=2
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.info=Info
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.info.build.code_debug=3
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.debug=Debug
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.debug.build.code_debug=4
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.verbose=Verbose
adafruit_feather_esp32s3_reversetft.menu.DebugLevel.verbose.build.code_debug=5

adafruit_feather_esp32s3_reversetft.menu.EraseFlash.none=Disabled
adafruit_feather_esp32s3_reversetft.menu.EraseFlash.none.upload.erase_cmd=
adafruit_feather_esp32s3_reversetft.menu.EraseFlash.all=Enabled
adafruit_feather_esp32s3_reversetft.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit QT Py ESP32-S3 No PSRAM

adafruit_qtpy_esp32s3_nopsram.name=Adafruit QT Py ESP32-S3 No PSRAM
adafruit_qtpy_esp32s3_nopsram.vid.0=0x239A
adafruit_qtpy_esp32s3_nopsram.pid.0=0x8119
adafruit_qtpy_esp32s3_nopsram.vid.1=0x239A
adafruit_qtpy_esp32s3_nopsram.pid.1=0x0119
adafruit_qtpy_esp32s3_nopsram.vid.2=0x239A
adafruit_qtpy_esp32s3_nopsram.pid.2=0x811A

adafruit_qtpy_esp32s3_nopsram.bootloader.tool=esptool_py
adafruit_qtpy_esp32s3_nopsram.bootloader.tool.default=esptool_py

adafruit_qtpy_esp32s3_nopsram.upload.tool=esptool_py
adafruit_qtpy_esp32s3_nopsram.upload.tool.default=esptool_py
adafruit_qtpy_esp32s3_nopsram.upload.tool.network=esp_ota

adafruit_qtpy_esp32s3_nopsram.upload.maximum_size=1310720
adafruit_qtpy_esp32s3_nopsram.upload.maximum_data_size=327680
adafruit_qtpy_esp32s3_nopsram.upload.flags=
adafruit_qtpy_esp32s3_nopsram.upload.extra_flags=
adafruit_qtpy_esp32s3_nopsram.upload.use_1200bps_touch=true
adafruit_qtpy_esp32s3_nopsram.upload.wait_for_upload_port=true

adafruit_qtpy_esp32s3_nopsram.serial.disableDTR=false
adafruit_qtpy_esp32s3_nopsram.serial.disableRTS=false

adafruit_qtpy_esp32s3_nopsram.build.tarch=xtensa
adafruit_qtpy_esp32s3_nopsram.build.bootloader_addr=0x0
adafruit_qtpy_esp32s3_nopsram.build.target=esp32s3
adafruit_qtpy_esp32s3_nopsram.build.mcu=esp32s3
adafruit_qtpy_esp32s3_nopsram.build.core=esp32
adafruit_qtpy_esp32s3_nopsram.build.variant=adafruit_qtpy_esp32s3_nopsram
adafruit_qtpy_esp32s3_nopsram.build.board=ADAFRUIT_QTPY_ESP32S3_NOPSRAM

adafruit_qtpy_esp32s3_nopsram.build.usb_mode=0
adafruit_qtpy_esp32s3_nopsram.build.cdc_on_boot=1
adafruit_qtpy_esp32s3_nopsram.build.msc_on_boot=0
adafruit_qtpy_esp32s3_nopsram.build.dfu_on_boot=0
adafruit_qtpy_esp32s3_nopsram.build.f_cpu=240000000L
adafruit_qtpy_esp32s3_nopsram.build.flash_size=8MB
adafruit_qtpy_esp32s3_nopsram.build.flash_freq=80m
adafruit_qtpy_esp32s3_nopsram.build.flash_mode=dio
adafruit_qtpy_esp32s3_nopsram.build.boot=qio
adafruit_qtpy_esp32s3_nopsram.build.partitions=default
adafruit_qtpy_esp32s3_nopsram.build.defines=
adafruit_qtpy_esp32s3_nopsram.build.loop_core=
adafruit_qtpy_esp32s3_nopsram.build.event_core=
adafruit_qtpy_esp32s3_nopsram.build.flash_type=qio
adafruit_qtpy_esp32s3_nopsram.build.psram_type=qspi
adafruit_qtpy_esp32s3_nopsram.build.memory_type={build.flash_type}_{build.psram_type}

