ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
esp32-DevKitLipo.menu.EraseFlash.none=Disabled
esp32-DevKitLipo.menu.EraseFlash.none.upload.erase_cmd=
esp32-DevKitLipo.menu.EraseFlash.all=Enabled
esp32-DevKitLipo.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

espino32.name=ThaiEasyElec's ESPino32

espino32.bootloader.tool=esptool_py
espino32.bootloader.tool.default=esptool_py

espino32.upload.tool=esptool_py
espino32.upload.tool.default=esptool_py
espino32.upload.tool.network=esp_ota

espino32.upload.maximum_size=1310720
espino32.upload.maximum_data_size=327680
espino32.upload.flags=
espino32.upload.extra_flags=

espino32.serial.disableDTR=true
espino32.serial.disableRTS=true

espino32.build.tarch=xtensa
espino32.build.bootloader_addr=0x1000
espino32.build.target=esp32
espino32.build.mcu=esp32
espino32.build.core=esp32
espino32.build.variant=espino32
espino32.build.board=ESPino32

espino32.build.f_cpu=240000000L
espino32.build.flash_mode=dio
espino32.build.flash_size=4MB
espino32.build.boot=dio
espino32.build.partitions=default
espino32.build.defines=

espino32.menu.FlashFreq.80=80MHz
espino32.menu.FlashFreq.80.build.flash_freq=80m
espino32.menu.FlashFreq.40=40MHz
espino32.menu.FlashFreq.40.build.flash_freq=40m

espino32.menu.UploadSpeed.921600=921600
espino32.menu.UploadSpeed.921600.upload.speed=921600
espino32.menu.UploadSpeed.115200=115200
espino32.menu.UploadSpeed.115200.upload.speed=115200
espino32.menu.UploadSpeed.256000.windows=256000
espino32.menu.UploadSpeed.256000.upload.speed=256000
espino32.menu.UploadSpeed.230400.windows.upload.speed=256000
espino32.menu.UploadSpeed.230400=230400
espino32.menu.UploadSpeed.230400.upload.speed=230400
espino32.menu.UploadSpeed.460800.linux=460800
espino32.menu.UploadSpeed.460800.macosx=460800
espino32.menu.UploadSpeed.460800.upload.speed=460800
espino32.menu.UploadSpeed.512000.windows=512000
espino32.menu.UploadSpeed.512000.upload.speed=512000

espino32.menu.DebugLevel.none=None
espino32.menu.DebugLevel.none.build.code_debug=0
espino32.menu.DebugLevel.error=Error
espino32.menu.DebugLevel.error.build.code_debug=1
espino32.menu.DebugLevel.warn=Warn
espino32.menu.DebugLevel.warn.build.code_debug=2
espino32.menu.DebugLevel.info=Info
espino32.menu.DebugLevel.info.build.code_debug=3
espino32.menu.DebugLevel.debug=Debug
espino32.menu.DebugLevel.debug.build.code_debug=4
espino32.menu.DebugLevel.verbose=Verbose
espino32.menu.DebugLevel.verbose.build.code_debug=5

espino32.menu.EraseFlash.none=Disabled
espino32.menu.EraseFlash.none.upload.erase_cmd=
espino32.menu.EraseFlash.all=Enabled
espino32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

m5stack-core-esp32.name=M5Stack-Core-ESP32

m5stack-core-esp32.bootloader.tool=esptool_py
m5stack-core-esp32.bootloader.tool.default=esptool_py

m5stack-core-esp32.upload.tool=esptool_py
m5stack-core-esp32.upload.tool.default=esptool_py
m5stack-core-esp32.upload.tool.network=esp_ota

m5stack-core-esp32.upload.maximum_size=1310720
m5stack-core-esp32.upload.maximum_data_size=327680
m5stack-core-esp32.upload.flags=
m5stack-core-esp32.upload.extra_flags=

m5stack-core-esp32.serial.disableDTR=true
m5stack-core-esp32.serial.disableRTS=true

m5stack-core-esp32.build.tarch=xtensa
m5stack-core-esp32.build.bootloader_addr=0x1000
m5stack-core-esp32.build.target=esp32
m5stack-core-esp32.build.mcu=esp32
m5stack-core-esp32.build.core=esp32
m5stack-core-esp32.build.variant=m5stack_core_esp32
m5stack-core-esp32.build.board=M5Stack_Core_ESP32

m5stack-core-esp32.build.f_cpu=240000000L
m5stack-core-esp32.build.flash_size=4MB
m5stack-core-esp32.build.flash_mode=dio
m5stack-core-esp32.build.boot=dio
m5stack-core-esp32.build.partitions=default
m5stack-core-esp32.build.defines=

m5stack-core-esp32.menu.FlashMode.qio=QIO
m5stack-core-esp32.menu.FlashMode.qio.build.flash_mode=dio
m5stack-core-esp32.menu.FlashMode.qio.build.boot=qio
m5stack-core-esp32.menu.FlashMode.dio=DIO
m5stack-core-esp32.menu.FlashMode.dio.build.flash_mode=dio
m5stack-core-esp32.menu.FlashMode.dio.build.boot=dio
m5stack-core-esp32.menu.FlashMode.qout=QOUT
m5stack-core-esp32.menu.FlashMode.qout.build.flash_mode=dout
m5stack-core-esp32.menu.FlashMode.qout.build.boot=qout
m5stack-core-esp32.menu.FlashMode.dout=DOUT
m5stack-core-esp32.menu.FlashMode.dout.build.flash_mode=dout
m5stack-core-esp32.menu.FlashMode.dout.build.boot=dout

m5stack-core-esp32.menu.FlashFreq.80=80MHz
m5stack-core-esp32.menu.FlashFreq.80.build.flash_freq=80m
m5stack-core-esp32.menu.FlashFreq.40=40MHz
m5stack-core-esp32.menu.FlashFreq.40.build.flash_freq=40m

m5stack-core-esp32.menu.PartitionScheme.default=Default
m5stack-core-esp32.menu.PartitionScheme.default.build.partitions=default
m5stack-core-esp32.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stack-core-esp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-core-esp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack-core-esp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stack-core-esp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-core-esp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack-core-esp32.menu.UploadSpeed.921600=921600
m5stack-core-esp32.menu.UploadSpeed.921600.upload.speed=921600
m5stack-core-esp32.menu.UploadSpeed.115200=115200
m5stack-core-esp32.menu.UploadSpeed.115200.upload.speed=115200
m5stack-core-esp32.menu.UploadSpeed.256000.windows=256000
m5stack-core-esp32.menu.UploadSpeed.256000.upload.speed=256000
m5stack-core-esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
m5stack-core-esp32.menu.UploadSpeed.230400=230400
m5stack-core-esp32.menu.UploadSpeed.230400.upload.speed=230400
m5stack-core-esp32.menu.UploadSpeed.460800.linux=460800
m5stack-core-esp32.menu.UploadSpeed.460800.macosx=460800
m5stack-core-esp32.menu.UploadSpeed.460800.upload.speed=460800
m5stack-core-esp32.menu.UploadSpeed.512000.windows=512000
m5stack-core-esp32.menu.UploadSpeed.512000.upload.speed=512000

m5stack-core-esp32.menu.DebugLevel.none=None
m5stack-core-esp32.menu.DebugLevel.none.build.code_debug=0
m5stack-core-esp32.menu.DebugLevel.error=Error
m5stack-core-esp32.menu.DebugLevel.error.build.code_debug=1
m5stack-core-esp32.menu.DebugLevel.warn=Warn
m5stack-core-esp32.menu.DebugLevel.warn.build.code_debug=2
m5stack-core-esp32.menu.DebugLevel.info=Info
m5stack-core-esp32.menu.DebugLevel.info.build.code_debug=3
m5stack-core-esp32.menu.DebugLevel.debug=Debug
m5stack-core-esp32.menu.DebugLevel.debug.build.code_debug=4
m5stack-core-esp32.menu.DebugLevel.verbose=Verbose
m5stack-core-esp32.menu.DebugLevel.verbose.build.code_debug=5

m5stack-core-esp32.menu.EraseFlash.none=Disabled
m5stack-core-esp32.menu.EraseFlash.none.upload.erase_cmd=
m5stack-core-esp32.menu.EraseFlash.all=Enabled
m5stack-core-esp32.menu.EraseFlash.all.upload.erase_cmd=-e

