ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
m5stack-coreink.menu.DebugLevel.none=None
m5stack-coreink.menu.DebugLevel.none.build.code_debug=0
m5stack-coreink.menu.DebugLevel.error=Error
m5stack-coreink.menu.DebugLevel.error.build.code_debug=1
m5stack-coreink.menu.DebugLevel.warn=Warn
m5stack-coreink.menu.DebugLevel.warn.build.code_debug=2
m5stack-coreink.menu.DebugLevel.info=Info
m5stack-coreink.menu.DebugLevel.info.build.code_debug=3
m5stack-coreink.menu.DebugLevel.debug=Debug
m5stack-coreink.menu.DebugLevel.debug.build.code_debug=4
m5stack-coreink.menu.DebugLevel.verbose=Verbose
m5stack-coreink.menu.DebugLevel.verbose.build.code_debug=5

m5stack-coreink.menu.EraseFlash.none=Disabled
m5stack-coreink.menu.EraseFlash.none.upload.erase_cmd=
m5stack-coreink.menu.EraseFlash.all=Enabled
m5stack-coreink.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

odroid_esp32.name=ODROID ESP32

odroid_esp32.bootloader.tool=esptool_py
odroid_esp32.bootloader.tool.default=esptool_py

odroid_esp32.upload.tool=esptool_py
odroid_esp32.upload.tool.default=esptool_py
odroid_esp32.upload.tool.network=esp_ota

odroid_esp32.upload.maximum_size=1310720
odroid_esp32.upload.maximum_data_size=327680
odroid_esp32.upload.flags=
odroid_esp32.upload.extra_flags=

odroid_esp32.serial.disableDTR=true
odroid_esp32.serial.disableRTS=true

odroid_esp32.build.tarch=xtensa
odroid_esp32.build.bootloader_addr=0x1000
odroid_esp32.build.target=esp32
odroid_esp32.build.mcu=esp32
odroid_esp32.build.core=esp32
odroid_esp32.build.variant=odroid_esp32
odroid_esp32.build.board=ODROID_ESP32

odroid_esp32.build.f_cpu=240000000L
odroid_esp32.build.flash_size=16MB
odroid_esp32.build.flash_mode=dio
odroid_esp32.build.boot=dio
odroid_esp32.build.partitions=default
odroid_esp32.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
odroid_esp32.build.extra_libs=

odroid_esp32.menu.FlashMode.qio=QIO
odroid_esp32.menu.FlashMode.qio.build.flash_mode=dio
odroid_esp32.menu.FlashMode.qio.build.boot=qio
odroid_esp32.menu.FlashMode.dio=DIO
odroid_esp32.menu.FlashMode.dio.build.flash_mode=dio
odroid_esp32.menu.FlashMode.dio.build.boot=dio
odroid_esp32.menu.FlashMode.qout=QOUT
odroid_esp32.menu.FlashMode.qout.build.flash_mode=dout
odroid_esp32.menu.FlashMode.qout.build.boot=qout
odroid_esp32.menu.FlashMode.dout=DOUT
odroid_esp32.menu.FlashMode.dout.build.flash_mode=dout
odroid_esp32.menu.FlashMode.dout.build.boot=dout

odroid_esp32.menu.FlashFreq.80=80MHz
odroid_esp32.menu.FlashFreq.80.build.flash_freq=80m
odroid_esp32.menu.FlashFreq.40=40MHz
odroid_esp32.menu.FlashFreq.40.build.flash_freq=40m

odroid_esp32.menu.PartitionScheme.default=Default
odroid_esp32.menu.PartitionScheme.default.build.partitions=default
odroid_esp32.menu.PartitionScheme.no_ota=No OTA (Large APP)
odroid_esp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
odroid_esp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
odroid_esp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
odroid_esp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
odroid_esp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

odroid_esp32.menu.UploadSpeed.921600=921600
odroid_esp32.menu.UploadSpeed.921600.upload.speed=921600
odroid_esp32.menu.UploadSpeed.115200=115200
odroid_esp32.menu.UploadSpeed.115200.upload.speed=115200
odroid_esp32.menu.UploadSpeed.256000.windows=256000
odroid_esp32.menu.UploadSpeed.256000.upload.speed=256000
odroid_esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
odroid_esp32.menu.UploadSpeed.230400=230400
odroid_esp32.menu.UploadSpeed.230400.upload.speed=230400
odroid_esp32.menu.UploadSpeed.460800.linux=460800
odroid_esp32.menu.UploadSpeed.460800.macosx=460800
odroid_esp32.menu.UploadSpeed.460800.upload.speed=460800
odroid_esp32.menu.UploadSpeed.512000.windows=512000
odroid_esp32.menu.UploadSpeed.512000.upload.speed=512000

odroid_esp32.menu.DebugLevel.none=None
odroid_esp32.menu.DebugLevel.none.build.code_debug=0
odroid_esp32.menu.DebugLevel.error=Error
odroid_esp32.menu.DebugLevel.error.build.code_debug=1
odroid_esp32.menu.DebugLevel.warn=Warn
odroid_esp32.menu.DebugLevel.warn.build.code_debug=2
odroid_esp32.menu.DebugLevel.info=Info
odroid_esp32.menu.DebugLevel.info.build.code_debug=3
odroid_esp32.menu.DebugLevel.debug=Debug
odroid_esp32.menu.DebugLevel.debug.build.code_debug=4
odroid_esp32.menu.DebugLevel.verbose=Verbose
odroid_esp32.menu.DebugLevel.verbose.build.code_debug=5

odroid_esp32.menu.EraseFlash.none=Disabled
odroid_esp32.menu.EraseFlash.none.upload.erase_cmd=
odroid_esp32.menu.EraseFlash.all=Enabled
odroid_esp32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

heltec_wifi_kit_32.name=Heltec WiFi Kit 32

heltec_wifi_kit_32.bootloader.tool=esptool_py
heltec_wifi_kit_32.bootloader.tool.default=esptool_py

heltec_wifi_kit_32.upload.tool=esptool_py
heltec_wifi_kit_32.upload.tool.default=esptool_py
heltec_wifi_kit_32.upload.tool.network=esp_ota

heltec_wifi_kit_32.upload.maximum_size=1310720
heltec_wifi_kit_32.upload.maximum_data_size=327680
heltec_wifi_kit_32.upload.flags=
heltec_wifi_kit_32.upload.extra_flags=

heltec_wifi_kit_32.serial.disableDTR=true
heltec_wifi_kit_32.serial.disableRTS=true

heltec_wifi_kit_32.build.tarch=xtensa
heltec_wifi_kit_32.build.bootloader_addr=0x1000
heltec_wifi_kit_32.build.target=esp32
heltec_wifi_kit_32.build.mcu=esp32
heltec_wifi_kit_32.build.core=esp32
heltec_wifi_kit_32.build.variant=heltec_wifi_kit_32
heltec_wifi_kit_32.build.board=heltec_wifi_kit_32

heltec_wifi_kit_32.build.f_cpu=240000000L
heltec_wifi_kit_32.build.flash_size=4MB
heltec_wifi_kit_32.build.flash_freq=80m
heltec_wifi_kit_32.build.flash_mode=dio
heltec_wifi_kit_32.build.boot=dio
heltec_wifi_kit_32.build.partitions=default
heltec_wifi_kit_32.build.defines=
heltec_wifi_kit_32.build.band=LoRaWAN_NONE
heltec_wifi_kit_32.build.LoRaWanDebugLevel=0

heltec_wifi_kit_32.menu.PSRAM.disabled=Disabled
heltec_wifi_kit_32.menu.PSRAM.disabled.build.defines=
heltec_wifi_kit_32.menu.PSRAM.disabled.build.extra_libs=
heltec_wifi_kit_32.menu.PSRAM.enabled=Enabled
heltec_wifi_kit_32.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
heltec_wifi_kit_32.menu.PSRAM.enabled.build.extra_libs=

heltec_wifi_kit_32.menu.CPUFreq.240=240MHz (WiFi/BT)
heltec_wifi_kit_32.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_wifi_kit_32.menu.CPUFreq.160=160MHz (WiFi/BT)
heltec_wifi_kit_32.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_wifi_kit_32.menu.CPUFreq.80=80MHz (WiFi/BT)
heltec_wifi_kit_32.menu.CPUFreq.80.build.f_cpu=80000000L

heltec_wifi_kit_32.menu.UploadSpeed.921600=921600
heltec_wifi_kit_32.menu.UploadSpeed.921600.upload.speed=921600
heltec_wifi_kit_32.menu.UploadSpeed.115200=115200
heltec_wifi_kit_32.menu.UploadSpeed.115200.upload.speed=115200
heltec_wifi_kit_32.menu.UploadSpeed.256000.windows=256000
heltec_wifi_kit_32.menu.UploadSpeed.256000.upload.speed=256000
heltec_wifi_kit_32.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_wifi_kit_32.menu.UploadSpeed.230400=230400
heltec_wifi_kit_32.menu.UploadSpeed.230400.upload.speed=230400
heltec_wifi_kit_32.menu.UploadSpeed.460800.linux=460800
heltec_wifi_kit_32.menu.UploadSpeed.460800.macosx=460800
heltec_wifi_kit_32.menu.UploadSpeed.460800.upload.speed=460800
heltec_wifi_kit_32.menu.UploadSpeed.512000.windows=512000
heltec_wifi_kit_32.menu.UploadSpeed.512000.upload.speed=512000

