ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
##############################################################

OpenKB.name=INEX OpenKB

OpenKB.bootloader.tool=esptool_py
OpenKB.bootloader.tool.default=esptool_py

OpenKB.upload.tool=esptool_py
OpenKB.upload.tool.default=esptool_py
OpenKB.upload.tool.network=esp_ota

OpenKB.upload.maximum_size=1310720
OpenKB.upload.maximum_data_size=327680
OpenKB.upload.wait_for_upload_port=true
OpenKB.upload.flags=
OpenKB.upload.extra_flags=

OpenKB.serial.disableDTR=true
OpenKB.serial.disableRTS=true

OpenKB.build.tarch=xtensa
OpenKB.build.bootloader_addr=0x1000
OpenKB.build.target=esp32
OpenKB.build.mcu=esp32
OpenKB.build.core=esp32
OpenKB.build.variant=openkb
OpenKB.build.board=openkb

OpenKB.build.f_cpu=240000000L
OpenKB.build.flash_mode=dio
OpenKB.build.flash_size=4MB
OpenKB.build.boot=dio
OpenKB.build.partitions=default
OpenKB.build.defines=

OpenKB.menu.FlashFreq.80=80MHz
OpenKB.menu.FlashFreq.80.build.flash_freq=80m
OpenKB.menu.FlashFreq.40=40MHz
OpenKB.menu.FlashFreq.40.build.flash_freq=40m

OpenKB.menu.UploadSpeed.921600=921600
OpenKB.menu.UploadSpeed.921600.upload.speed=921600
OpenKB.menu.UploadSpeed.115200=115200
OpenKB.menu.UploadSpeed.115200.upload.speed=115200
OpenKB.menu.UploadSpeed.256000.windows=256000
OpenKB.menu.UploadSpeed.256000.upload.speed=256000
OpenKB.menu.UploadSpeed.230400.windows.upload.speed=256000
OpenKB.menu.UploadSpeed.230400=230400
OpenKB.menu.UploadSpeed.230400.upload.speed=230400
OpenKB.menu.UploadSpeed.460800.linux=460800
OpenKB.menu.UploadSpeed.460800.macosx=460800
OpenKB.menu.UploadSpeed.460800.upload.speed=460800
OpenKB.menu.UploadSpeed.512000.windows=512000
OpenKB.menu.UploadSpeed.512000.upload.speed=512000

OpenKB.menu.DebugLevel.none=None
OpenKB.menu.DebugLevel.none.build.code_debug=0
OpenKB.menu.DebugLevel.error=Error
OpenKB.menu.DebugLevel.error.build.code_debug=1
OpenKB.menu.DebugLevel.warn=Warn
OpenKB.menu.DebugLevel.warn.build.code_debug=2
OpenKB.menu.DebugLevel.info=Info
OpenKB.menu.DebugLevel.info.build.code_debug=3
OpenKB.menu.DebugLevel.debug=Debug
OpenKB.menu.DebugLevel.debug.build.code_debug=4
OpenKB.menu.DebugLevel.verbose=Verbose
OpenKB.menu.DebugLevel.verbose.build.code_debug=5

OpenKB.menu.EraseFlash.none=Disabled
OpenKB.menu.EraseFlash.none.upload.erase_cmd=
OpenKB.menu.EraseFlash.all=Enabled
OpenKB.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

wifiduino32.name=WiFiduino32

wifiduino32.bootloader.tool=esptool_py
wifiduino32.bootloader.tool.default=esptool_py

wifiduino32.upload.tool=esptool_py
wifiduino32.upload.tool.default=esptool_py
wifiduino32.upload.tool.network=esp_ota

wifiduino32.upload.maximum_size=1310720
wifiduino32.upload.maximum_data_size=327680
wifiduino32.upload.wait_for_upload_port=true
wifiduino32.upload.flags=
wifiduino32.upload.extra_flags=

wifiduino32.serial.disableDTR=true
wifiduino32.serial.disableRTS=true

wifiduino32.build.tarch=xtensa
wifiduino32.build.bootloader_addr=0x1000
wifiduino32.build.target=esp32
wifiduino32.build.mcu=esp32
wifiduino32.build.core=esp32
wifiduino32.build.variant=wifiduino32
wifiduino32.build.board=Wifiduino32

wifiduino32.build.f_cpu=240000000L
wifiduino32.build.flash_mode=dio
wifiduino32.build.flash_size=4MB
wifiduino32.build.boot=dio
wifiduino32.build.partitions=default
wifiduino32.build.defines=

wifiduino32.menu.PartitionScheme.default=Default
wifiduino32.menu.PartitionScheme.default.build.partitions=default
wifiduino32.menu.PartitionScheme.no_ota=No OTA (Large APP)
wifiduino32.menu.PartitionScheme.no_ota.build.partitions=no_ota
wifiduino32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wifiduino32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
wifiduino32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wifiduino32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

wifiduino32.menu.FlashFreq.80=80MHz
wifiduino32.menu.FlashFreq.80.build.flash_freq=80m
wifiduino32.menu.FlashFreq.40=40MHz
wifiduino32.menu.FlashFreq.40.build.flash_freq=40m

wifiduino32.menu.UploadSpeed.921600=921600
wifiduino32.menu.UploadSpeed.921600.upload.speed=921600
wifiduino32.menu.UploadSpeed.115200=115200
wifiduino32.menu.UploadSpeed.115200.upload.speed=115200
wifiduino32.menu.UploadSpeed.256000.windows=256000
wifiduino32.menu.UploadSpeed.256000.upload.speed=256000
wifiduino32.menu.UploadSpeed.230400.windows.upload.speed=256000
wifiduino32.menu.UploadSpeed.230400=230400
wifiduino32.menu.UploadSpeed.230400.upload.speed=230400
wifiduino32.menu.UploadSpeed.460800.linux=460800
wifiduino32.menu.UploadSpeed.460800.macosx=460800
wifiduino32.menu.UploadSpeed.460800.upload.speed=460800
wifiduino32.menu.UploadSpeed.512000.windows=512000
wifiduino32.menu.UploadSpeed.512000.upload.speed=512000

wifiduino32.menu.DebugLevel.none=None
wifiduino32.menu.DebugLevel.none.build.code_debug=0
wifiduino32.menu.DebugLevel.error=Error
wifiduino32.menu.DebugLevel.error.build.code_debug=1
wifiduino32.menu.DebugLevel.warn=Warn
wifiduino32.menu.DebugLevel.warn.build.code_debug=2
wifiduino32.menu.DebugLevel.info=Info
wifiduino32.menu.DebugLevel.info.build.code_debug=3
wifiduino32.menu.DebugLevel.debug=Debug
wifiduino32.menu.DebugLevel.debug.build.code_debug=4
wifiduino32.menu.DebugLevel.verbose=Verbose
wifiduino32.menu.DebugLevel.verbose.build.code_debug=5

wifiduino32.menu.EraseFlash.none=Disabled
wifiduino32.menu.EraseFlash.none.upload.erase_cmd=
wifiduino32.menu.EraseFlash.all=Enabled
wifiduino32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

wifiduino32c3.name=WiFiduinoV2
wifiduino32c3.vid.0=0x303a
wifiduino32c3.pid.0=0x1001

wifiduino32c3.bootloader.tool=esptool_py
wifiduino32c3.bootloader.tool.default=esptool_py

wifiduino32c3.upload.tool=esptool_py
wifiduino32c3.upload.tool.default=esptool_py
wifiduino32c3.upload.tool.network=esp_ota

wifiduino32c3.upload.maximum_size=1310720
wifiduino32c3.upload.maximum_data_size=327680
wifiduino32c3.upload.flags=
wifiduino32c3.upload.extra_flags=
wifiduino32c3.upload.use_1200bps_touch=false
wifiduino32c3.upload.wait_for_upload_port=false

