ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
deneyapkart1A.menu.FlashFreq.80=80MHz
deneyapkart1A.menu.FlashFreq.80.build.flash_freq=80m
deneyapkart1A.menu.FlashFreq.40=40MHz
deneyapkart1A.menu.FlashFreq.40.build.flash_freq=40m

deneyapkart1A.menu.FlashSize.4M=4MB (32Mb)
deneyapkart1A.menu.FlashSize.4M.build.flash_size=4MB
deneyapkart1A.menu.FlashSize.8M=8MB (64Mb)
deneyapkart1A.menu.FlashSize.8M.build.flash_size=8MB
deneyapkart1A.menu.FlashSize.8M.build.partitions=default_8MB
deneyapkart1A.menu.FlashSize.2M=2MB (16Mb)
deneyapkart1A.menu.FlashSize.2M.build.flash_size=2MB
deneyapkart1A.menu.FlashSize.2M.build.partitions=minimal
deneyapkart1A.menu.FlashSize.16M=16MB (128Mb)
deneyapkart1A.menu.FlashSize.16M.build.flash_size=16MB

deneyapkart1A.menu.UploadSpeed.921600=921600
deneyapkart1A.menu.UploadSpeed.921600.upload.speed=921600
deneyapkart1A.menu.UploadSpeed.115200=115200
deneyapkart1A.menu.UploadSpeed.115200.upload.speed=115200
deneyapkart1A.menu.UploadSpeed.256000.windows=256000
deneyapkart1A.menu.UploadSpeed.256000.upload.speed=256000
deneyapkart1A.menu.UploadSpeed.230400.windows.upload.speed=256000
deneyapkart1A.menu.UploadSpeed.230400=230400
deneyapkart1A.menu.UploadSpeed.230400.upload.speed=230400
deneyapkart1A.menu.UploadSpeed.460800.linux=460800
deneyapkart1A.menu.UploadSpeed.460800.macosx=460800
deneyapkart1A.menu.UploadSpeed.460800.upload.speed=460800
deneyapkart1A.menu.UploadSpeed.512000.windows=512000
deneyapkart1A.menu.UploadSpeed.512000.upload.speed=512000

deneyapkart1A.menu.LoopCore.1=Core 1
deneyapkart1A.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
deneyapkart1A.menu.LoopCore.0=Core 0
deneyapkart1A.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

deneyapkart1A.menu.EventsCore.1=Core 1
deneyapkart1A.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
deneyapkart1A.menu.EventsCore.0=Core 0
deneyapkart1A.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

deneyapkart1A.menu.DebugLevel.none=None
deneyapkart1A.menu.DebugLevel.none.build.code_debug=0
deneyapkart1A.menu.DebugLevel.error=Error
deneyapkart1A.menu.DebugLevel.error.build.code_debug=1
deneyapkart1A.menu.DebugLevel.warn=Warn
deneyapkart1A.menu.DebugLevel.warn.build.code_debug=2
deneyapkart1A.menu.DebugLevel.info=Info
deneyapkart1A.menu.DebugLevel.info.build.code_debug=3
deneyapkart1A.menu.DebugLevel.debug=Debug
deneyapkart1A.menu.DebugLevel.debug.build.code_debug=4
deneyapkart1A.menu.DebugLevel.verbose=Verbose
deneyapkart1A.menu.DebugLevel.verbose.build.code_debug=5

deneyapkart1A.menu.EraseFlash.none=Disabled
deneyapkart1A.menu.EraseFlash.none.upload.erase_cmd=
deneyapkart1A.menu.EraseFlash.all=Enabled
deneyapkart1A.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

deneyapkart1Av2.name=Deneyap Kart 1A v2

deneyapkart1Av2.vid.0=0x303a
deneyapkart1Av2.pid.0=0x8147

deneyapkart1Av2.bootloader.tool=esptool_py
deneyapkart1Av2.bootloader.tool.default=esptool_py

deneyapkart1Av2.upload.tool=esptool_py
deneyapkart1Av2.upload.tool.default=esptool_py
deneyapkart1Av2.upload.tool.network=esp_ota

deneyapkart1Av2.upload.maximum_size=1310720
deneyapkart1Av2.upload.maximum_data_size=327680
deneyapkart1Av2.upload.flags=
deneyapkart1Av2.upload.extra_flags=
deneyapkart1Av2.upload.use_1200bps_touch=false
deneyapkart1Av2.upload.wait_for_upload_port=false

deneyapkart1Av2.serial.disableDTR=false
deneyapkart1Av2.serial.disableRTS=false

deneyapkart1Av2.build.tarch=xtensa
deneyapkart1Av2.build.bootloader_addr=0x0
deneyapkart1Av2.build.target=esp32s3
deneyapkart1Av2.build.mcu=esp32s3
deneyapkart1Av2.build.core=esp32
deneyapkart1Av2.build.variant=deneyapkart1Av2
deneyapkart1Av2.build.board=DYDK1Av2

deneyapkart1Av2.build.usb_mode=1
deneyapkart1Av2.build.cdc_on_boot=1
deneyapkart1Av2.build.msc_on_boot=0
deneyapkart1Av2.build.dfu_on_boot=0
deneyapkart1Av2.build.f_cpu=240000000L
deneyapkart1Av2.build.flash_size=4MB
deneyapkart1Av2.build.flash_freq=80m
deneyapkart1Av2.build.flash_mode=dio
deneyapkart1Av2.build.boot=qio
deneyapkart1Av2.build.boot_freq=80m
deneyapkart1Av2.build.partitions=default
deneyapkart1Av2.build.defines=-DBOARD_HAS_PSRAM
deneyapkart1Av2.build.loop_core=
deneyapkart1Av2.build.event_core=
deneyapkart1Av2.build.psram_type=opi
deneyapkart1Av2.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
deneyapkart1Av2.menu.JTAGAdapter.default=Disabled
deneyapkart1Av2.menu.JTAGAdapter.default.build.copy_jtag_files=0
deneyapkart1Av2.menu.JTAGAdapter.builtin=Integrated USB JTAG
deneyapkart1Av2.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
deneyapkart1Av2.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
deneyapkart1Av2.menu.JTAGAdapter.external=FTDI Adapter
deneyapkart1Av2.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
deneyapkart1Av2.menu.JTAGAdapter.external.build.copy_jtag_files=1
deneyapkart1Av2.menu.JTAGAdapter.bridge=ESP USB Bridge
deneyapkart1Av2.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
deneyapkart1Av2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

deneyapkart1Av2.menu.PSRAM.opi=OPI PSRAM
deneyapkart1Av2.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
deneyapkart1Av2.menu.PSRAM.opi.build.psram_type=opi
deneyapkart1Av2.menu.PSRAM.disabled=Disabled
deneyapkart1Av2.menu.PSRAM.disabled.build.defines=
deneyapkart1Av2.menu.PSRAM.disabled.build.psram_type=qspi
deneyapkart1Av2.menu.PSRAM.enabled=QSPI PSRAM
deneyapkart1Av2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
deneyapkart1Av2.menu.PSRAM.enabled.build.psram_type=qspi

deneyapkart1Av2.menu.FlashMode.qio=QIO 80MHz
deneyapkart1Av2.menu.FlashMode.qio.build.flash_mode=dio
deneyapkart1Av2.menu.FlashMode.qio.build.boot=qio
deneyapkart1Av2.menu.FlashMode.qio.build.boot_freq=80m
deneyapkart1Av2.menu.FlashMode.qio.build.flash_freq=80m
deneyapkart1Av2.menu.FlashMode.qio120=QIO 120MHz
deneyapkart1Av2.menu.FlashMode.qio120.build.flash_mode=dio
deneyapkart1Av2.menu.FlashMode.qio120.build.boot=qio
deneyapkart1Av2.menu.FlashMode.qio120.build.boot_freq=120m
deneyapkart1Av2.menu.FlashMode.qio120.build.flash_freq=80m
deneyapkart1Av2.menu.FlashMode.dio=DIO 80MHz
deneyapkart1Av2.menu.FlashMode.dio.build.flash_mode=dio
deneyapkart1Av2.menu.FlashMode.dio.build.boot=dio
deneyapkart1Av2.menu.FlashMode.dio.build.boot_freq=80m
deneyapkart1Av2.menu.FlashMode.dio.build.flash_freq=80m
deneyapkart1Av2.menu.FlashMode.opi=OPI 80MHz
deneyapkart1Av2.menu.FlashMode.opi.build.flash_mode=dout
deneyapkart1Av2.menu.FlashMode.opi.build.boot=opi
deneyapkart1Av2.menu.FlashMode.opi.build.boot_freq=80m
deneyapkart1Av2.menu.FlashMode.opi.build.flash_freq=80m

deneyapkart1Av2.menu.FlashSize.4M=4MB (32Mb)
deneyapkart1Av2.menu.FlashSize.4M.build.flash_size=4MB
deneyapkart1Av2.menu.FlashSize.8M=8MB (64Mb)
deneyapkart1Av2.menu.FlashSize.8M.build.flash_size=8MB
deneyapkart1Av2.menu.FlashSize.8M.build.partitions=default_8MB
deneyapkart1Av2.menu.FlashSize.16M=16MB (128Mb)
deneyapkart1Av2.menu.FlashSize.16M.build.flash_size=16MB
#deneyapkart1Av2.menu.FlashSize.32M=32MB (256Mb)
#deneyapkart1Av2.menu.FlashSize.32M.build.flash_size=32MB

deneyapkart1Av2.menu.LoopCore.1=Core 1
deneyapkart1Av2.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
deneyapkart1Av2.menu.LoopCore.0=Core 0
deneyapkart1Av2.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

deneyapkart1Av2.menu.EventsCore.1=Core 1
deneyapkart1Av2.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
deneyapkart1Av2.menu.EventsCore.0=Core 0
deneyapkart1Av2.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

deneyapkart1Av2.menu.USBMode.hwcdc=Hardware CDC and JTAG
deneyapkart1Av2.menu.USBMode.hwcdc.build.usb_mode=1
deneyapkart1Av2.menu.USBMode.default=USB-OTG (TinyUSB)
deneyapkart1Av2.menu.USBMode.default.build.usb_mode=0

deneyapkart1Av2.menu.CDCOnBoot.cdc=Enabled
deneyapkart1Av2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
deneyapkart1Av2.menu.CDCOnBoot.default=Disabled
deneyapkart1Av2.menu.CDCOnBoot.default.build.cdc_on_boot=0

deneyapkart1Av2.menu.MSCOnBoot.default=Disabled
deneyapkart1Av2.menu.MSCOnBoot.default.build.msc_on_boot=0
deneyapkart1Av2.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
deneyapkart1Av2.menu.MSCOnBoot.msc.build.msc_on_boot=1

deneyapkart1Av2.menu.DFUOnBoot.default=Disabled
deneyapkart1Av2.menu.DFUOnBoot.default.build.dfu_on_boot=0
deneyapkart1Av2.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
deneyapkart1Av2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

