ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
deneyapkart1Av2.menu.UploadMode.default=UART0 / Hardware CDC
deneyapkart1Av2.menu.UploadMode.default.upload.use_1200bps_touch=false
deneyapkart1Av2.menu.UploadMode.default.upload.wait_for_upload_port=false
deneyapkart1Av2.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
deneyapkart1Av2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
deneyapkart1Av2.menu.UploadMode.cdc.upload.wait_for_upload_port=true

deneyapkart1Av2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
deneyapkart1Av2.menu.PartitionScheme.default.build.partitions=default
deneyapkart1Av2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
deneyapkart1Av2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
deneyapkart1Av2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
deneyapkart1Av2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
deneyapkart1Av2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
deneyapkart1Av2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
deneyapkart1Av2.menu.PartitionScheme.minimal.build.partitions=minimal
deneyapkart1Av2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
deneyapkart1Av2.menu.PartitionScheme.no_ota.build.partitions=no_ota
deneyapkart1Av2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
deneyapkart1Av2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
deneyapkart1Av2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
deneyapkart1Av2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
deneyapkart1Av2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
deneyapkart1Av2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
deneyapkart1Av2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
deneyapkart1Av2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
deneyapkart1Av2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
deneyapkart1Av2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
deneyapkart1Av2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
deneyapkart1Av2.menu.PartitionScheme.huge_app.build.partitions=huge_app
deneyapkart1Av2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
deneyapkart1Av2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
deneyapkart1Av2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
deneyapkart1Av2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
deneyapkart1Av2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
deneyapkart1Av2.menu.PartitionScheme.fatflash.build.partitions=ffat
deneyapkart1Av2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
deneyapkart1Av2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
deneyapkart1Av2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
deneyapkart1Av2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
deneyapkart1Av2.menu.PartitionScheme.rainmaker=RainMaker
deneyapkart1Av2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
deneyapkart1Av2.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

deneyapkart1Av2.menu.CPUFreq.240=240MHz (WiFi)
deneyapkart1Av2.menu.CPUFreq.240.build.f_cpu=240000000L
deneyapkart1Av2.menu.CPUFreq.160=160MHz (WiFi)
deneyapkart1Av2.menu.CPUFreq.160.build.f_cpu=160000000L
deneyapkart1Av2.menu.CPUFreq.80=80MHz (WiFi)
deneyapkart1Av2.menu.CPUFreq.80.build.f_cpu=80000000L
deneyapkart1Av2.menu.CPUFreq.40=40MHz
deneyapkart1Av2.menu.CPUFreq.40.build.f_cpu=40000000L
deneyapkart1Av2.menu.CPUFreq.20=20MHz
deneyapkart1Av2.menu.CPUFreq.20.build.f_cpu=20000000L
deneyapkart1Av2.menu.CPUFreq.10=10MHz
deneyapkart1Av2.menu.CPUFreq.10.build.f_cpu=10000000L

deneyapkart1Av2.menu.UploadSpeed.921600=921600
deneyapkart1Av2.menu.UploadSpeed.921600.upload.speed=921600
deneyapkart1Av2.menu.UploadSpeed.115200=115200
deneyapkart1Av2.menu.UploadSpeed.115200.upload.speed=115200
deneyapkart1Av2.menu.UploadSpeed.256000.windows=256000
deneyapkart1Av2.menu.UploadSpeed.256000.upload.speed=256000
deneyapkart1Av2.menu.UploadSpeed.230400.windows.upload.speed=256000
deneyapkart1Av2.menu.UploadSpeed.230400=230400
deneyapkart1Av2.menu.UploadSpeed.230400.upload.speed=230400
deneyapkart1Av2.menu.UploadSpeed.460800.linux=460800
deneyapkart1Av2.menu.UploadSpeed.460800.macosx=460800
deneyapkart1Av2.menu.UploadSpeed.460800.upload.speed=460800
deneyapkart1Av2.menu.UploadSpeed.512000.windows=512000
deneyapkart1Av2.menu.UploadSpeed.512000.upload.speed=512000

deneyapkart1Av2.menu.DebugLevel.none=None
deneyapkart1Av2.menu.DebugLevel.none.build.code_debug=0
deneyapkart1Av2.menu.DebugLevel.error=Error
deneyapkart1Av2.menu.DebugLevel.error.build.code_debug=1
deneyapkart1Av2.menu.DebugLevel.warn=Warn
deneyapkart1Av2.menu.DebugLevel.warn.build.code_debug=2
deneyapkart1Av2.menu.DebugLevel.info=Info
deneyapkart1Av2.menu.DebugLevel.info.build.code_debug=3
deneyapkart1Av2.menu.DebugLevel.debug=Debug
deneyapkart1Av2.menu.DebugLevel.debug.build.code_debug=4
deneyapkart1Av2.menu.DebugLevel.verbose=Verbose
deneyapkart1Av2.menu.DebugLevel.verbose.build.code_debug=5

deneyapkart1Av2.menu.EraseFlash.none=Disabled
deneyapkart1Av2.menu.EraseFlash.none.upload.erase_cmd=
deneyapkart1Av2.menu.EraseFlash.all=Enabled
deneyapkart1Av2.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

deneyapkartg.name=Deneyap Kart G

deneyapkartg.vid.0=0x303a
deneyapkartg.pid.0=0x814A

deneyapkartg.bootloader.tool=esptool_py
deneyapkartg.bootloader.tool.default=esptool_py

deneyapkartg.upload.tool=esptool_py
deneyapkartg.upload.tool.default=esptool_py
deneyapkartg.upload.tool.network=esp_ota

deneyapkartg.upload.maximum_size=1310720
deneyapkartg.upload.maximum_data_size=327680
deneyapkartg.upload.flags=
deneyapkartg.upload.extra_flags=
deneyapkartg.upload.use_1200bps_touch=false
deneyapkartg.upload.wait_for_upload_port=false

deneyapkartg.serial.disableDTR=false
deneyapkartg.serial.disableRTS=false

deneyapkartg.build.tarch=riscv32
deneyapkartg.build.target=esp
deneyapkartg.build.mcu=esp32c3
deneyapkartg.build.core=esp32
deneyapkartg.build.variant=deneyapkartg
deneyapkartg.build.board=DYG
deneyapkartg.build.bootloader_addr=0x0

