ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
VALTRACK_V4_MFW_ESP32_C3.menu.FlashMode.qio=QIO
VALTRACK_V4_MFW_ESP32_C3.menu.FlashMode.qio.build.flash_mode=dio
VALTRACK_V4_MFW_ESP32_C3.menu.FlashMode.qio.build.boot=qio
VALTRACK_V4_MFW_ESP32_C3.menu.FlashMode.dio=DIO
VALTRACK_V4_MFW_ESP32_C3.menu.FlashMode.dio.build.flash_mode=dio
VALTRACK_V4_MFW_ESP32_C3.menu.FlashMode.dio.build.boot=dio
VALTRACK_V4_MFW_ESP32_C3.menu.FlashMode.qout=QOUT
VALTRACK_V4_MFW_ESP32_C3.menu.FlashMode.qout.build.flash_mode=dout
VALTRACK_V4_MFW_ESP32_C3.menu.FlashMode.qout.build.boot=qout
VALTRACK_V4_MFW_ESP32_C3.menu.FlashMode.dout=DOUT
VALTRACK_V4_MFW_ESP32_C3.menu.FlashMode.dout.build.flash_mode=dout

VALTRACK_V4_MFW_ESP32_C3.menu.FlashFreq.80=80MHz
VALTRACK_V4_MFW_ESP32_C3.menu.FlashFreq.80.build.flash_freq=80m
VALTRACK_V4_MFW_ESP32_C3.menu.FlashFreq.40=40MHz
VALTRACK_V4_MFW_ESP32_C3.menu.FlashFreq.40.build.flash_freq=40m

VALTRACK_V4_MFW_ESP32_C3.menu.FlashSize.4M=4MB (32Mb)
VALTRACK_V4_MFW_ESP32_C3.menu.FlashSize.4M.build.flash_size=4MB
VALTRACK_V4_MFW_ESP32_C3.menu.FlashSize.8M=8MB (64Mb)
VALTRACK_V4_MFW_ESP32_C3.menu.FlashSize.8M.build.flash_size=8MB
VALTRACK_V4_MFW_ESP32_C3.menu.FlashSize.8M.build.partitions=default_8MB
VALTRACK_V4_MFW_ESP32_C3.menu.FlashSize.2M=2MB (16Mb)
VALTRACK_V4_MFW_ESP32_C3.menu.FlashSize.2M.build.flash_size=2MB
VALTRACK_V4_MFW_ESP32_C3.menu.FlashSize.2M.build.partitions=minimal
VALTRACK_V4_MFW_ESP32_C3.menu.FlashSize.16M=16MB (128Mb)
VALTRACK_V4_MFW_ESP32_C3.menu.FlashSize.16M.build.flash_size=16MB

VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.921600=921600
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.921600.upload.speed=921600
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.115200=115200
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.115200.upload.speed=115200
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.256000.windows=256000
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.256000.upload.speed=256000
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.230400.windows.upload.speed=256000
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.230400=230400
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.230400.upload.speed=230400
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.460800.linux=460800
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.460800.macosx=460800
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.460800.upload.speed=460800
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.512000.windows=512000
VALTRACK_V4_MFW_ESP32_C3.menu.UploadSpeed.512000.upload.speed=512000

VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.none=None
VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.none.build.code_debug=0
VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.error=Error
VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.error.build.code_debug=1
VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.warn=Warn
VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.warn.build.code_debug=2
VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.info=Info
VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.info.build.code_debug=3
VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.debug=Debug
VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.debug.build.code_debug=4
VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.verbose=Verbose
VALTRACK_V4_MFW_ESP32_C3.menu.DebugLevel.verbose.build.code_debug=5

VALTRACK_V4_MFW_ESP32_C3.menu.EraseFlash.none=Disabled
VALTRACK_V4_MFW_ESP32_C3.menu.EraseFlash.none.upload.erase_cmd=
VALTRACK_V4_MFW_ESP32_C3.menu.EraseFlash.all=Enabled
VALTRACK_V4_MFW_ESP32_C3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

Edgebox-ESP-100.name=Edgebox-ESP-100

Edgebox-ESP-100.bootloader.tool=esptool_py
Edgebox-ESP-100.bootloader.tool.default=esptool_py

Edgebox-ESP-100.upload.tool=esptool_py
Edgebox-ESP-100.upload.tool.default=esptool_py
Edgebox-ESP-100.upload.tool.network=esp_ota

Edgebox-ESP-100.upload.maximum_size=1310720
Edgebox-ESP-100.upload.maximum_data_size=327680
Edgebox-ESP-100.upload.flags=
Edgebox-ESP-100.upload.extra_flags=
Edgebox-ESP-100.upload.use_1200bps_touch=false
Edgebox-ESP-100.upload.wait_for_upload_port=false

Edgebox-ESP-100.serial.disableDTR=false
Edgebox-ESP-100.serial.disableRTS=false

Edgebox-ESP-100.build.tarch=xtensa
Edgebox-ESP-100.build.bootloader_addr=0x0
Edgebox-ESP-100.build.target=esp32s3
Edgebox-ESP-100.build.mcu=esp32s3
Edgebox-ESP-100.build.core=esp32
Edgebox-ESP-100.build.variant=Edgebox-ESP-100
Edgebox-ESP-100.build.board=Edgebox-ESP-100

Edgebox-ESP-100.build.usb_mode=1
Edgebox-ESP-100.build.cdc_on_boot=0
Edgebox-ESP-100.build.msc_on_boot=0
Edgebox-ESP-100.build.dfu_on_boot=0
Edgebox-ESP-100.build.f_cpu=240000000L
Edgebox-ESP-100.build.flash_size=4MB
Edgebox-ESP-100.build.flash_freq=80m
Edgebox-ESP-100.build.flash_mode=dio
Edgebox-ESP-100.build.boot=qio
Edgebox-ESP-100.build.boot_freq=80m
Edgebox-ESP-100.build.partitions=default
Edgebox-ESP-100.build.defines=
Edgebox-ESP-100.build.loop_core=
Edgebox-ESP-100.build.event_core=
Edgebox-ESP-100.build.psram_type=qspi
Edgebox-ESP-100.build.memory_type={build.boot}_{build.psram_type}

Edgebox-ESP-100.menu.PSRAM.disabled=Disabled
Edgebox-ESP-100.menu.PSRAM.disabled.build.defines=
Edgebox-ESP-100.menu.PSRAM.disabled.build.psram_type=qspi
Edgebox-ESP-100.menu.PSRAM.enabled=QSPI PSRAM
Edgebox-ESP-100.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
Edgebox-ESP-100.menu.PSRAM.enabled.build.psram_type=qspi
Edgebox-ESP-100.menu.PSRAM.opi=OPI PSRAM
Edgebox-ESP-100.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
Edgebox-ESP-100.menu.PSRAM.opi.build.psram_type=opi

Edgebox-ESP-100.menu.FlashMode.qio=QIO 80MHz
Edgebox-ESP-100.menu.FlashMode.qio.build.flash_mode=dio
Edgebox-ESP-100.menu.FlashMode.qio.build.boot=qio
Edgebox-ESP-100.menu.FlashMode.qio.build.boot_freq=80m
Edgebox-ESP-100.menu.FlashMode.qio.build.flash_freq=80m
Edgebox-ESP-100.menu.FlashMode.qio120=QIO 120MHz
Edgebox-ESP-100.menu.FlashMode.qio120.build.flash_mode=dio
Edgebox-ESP-100.menu.FlashMode.qio120.build.boot=qio
Edgebox-ESP-100.menu.FlashMode.qio120.build.boot_freq=120m
Edgebox-ESP-100.menu.FlashMode.qio120.build.flash_freq=80m
Edgebox-ESP-100.menu.FlashMode.dio=DIO 80MHz
Edgebox-ESP-100.menu.FlashMode.dio.build.flash_mode=dio
Edgebox-ESP-100.menu.FlashMode.dio.build.boot=dio
Edgebox-ESP-100.menu.FlashMode.dio.build.boot_freq=80m
Edgebox-ESP-100.menu.FlashMode.dio.build.flash_freq=80m
Edgebox-ESP-100.menu.FlashMode.opi=OPI 80MHz
Edgebox-ESP-100.menu.FlashMode.opi.build.flash_mode=dout
Edgebox-ESP-100.menu.FlashMode.opi.build.boot=opi
Edgebox-ESP-100.menu.FlashMode.opi.build.boot_freq=80m
Edgebox-ESP-100.menu.FlashMode.opi.build.flash_freq=80m

