ricardoquesada/esp32-arduino-lib-builder/bluepad32_files/boards.txt
##############################################################

crabik_slot_esp32_s3.name=Crabik Slot ESP32-S3
crabik_slot_esp32_s3.vid.0=0x303a
crabik_slot_esp32_s3.pid.0=0x1001

crabik_slot_esp32_s3.bootloader.tool=esptool_py
crabik_slot_esp32_s3.bootloader.tool.default=esptool_py

crabik_slot_esp32_s3.upload.tool=esptool_py
crabik_slot_esp32_s3.upload.tool.default=esptool_py
crabik_slot_esp32_s3.upload.tool.network=esp_ota

crabik_slot_esp32_s3.upload.maximum_size=1310720
crabik_slot_esp32_s3.upload.maximum_data_size=327680
crabik_slot_esp32_s3.upload.speed=921600
crabik_slot_esp32_s3.upload.flags=
crabik_slot_esp32_s3.upload.extra_flags=
crabik_slot_esp32_s3.upload.use_1200bps_touch=false
crabik_slot_esp32_s3.upload.wait_for_upload_port=false

crabik_slot_esp32_s3.serial.disableDTR=false
crabik_slot_esp32_s3.serial.disableRTS=false

crabik_slot_esp32_s3.build.tarch=xtensa
crabik_slot_esp32_s3.build.bootloader_addr=0x0
crabik_slot_esp32_s3.build.target=esp32s3
crabik_slot_esp32_s3.build.mcu=esp32s3
crabik_slot_esp32_s3.build.core=esp32
crabik_slot_esp32_s3.build.variant=crabik_slot_esp32_s3
crabik_slot_esp32_s3.build.board=CRABIK_SLOT_ESP32_S3

crabik_slot_esp32_s3.build.usb_mode=0
crabik_slot_esp32_s3.build.cdc_on_boot=0
crabik_slot_esp32_s3.build.msc_on_boot=0
crabik_slot_esp32_s3.build.dfu_on_boot=0
crabik_slot_esp32_s3.build.f_cpu=240000000L
crabik_slot_esp32_s3.build.flash_size=8MB
crabik_slot_esp32_s3.build.flash_freq=80m
crabik_slot_esp32_s3.build.flash_mode=dio
crabik_slot_esp32_s3.build.boot=qio
crabik_slot_esp32_s3.build.partitions=default
crabik_slot_esp32_s3.build.defines=
crabik_slot_esp32_s3.build.memory_type=qio_qspi
crabik_slot_esp32_s3.build.loop_core=
crabik_slot_esp32_s3.build.event_core=

## IDE 2.0 Seems to not update the value
crabik_slot_esp32_s3.menu.JTAGAdapter.default=Disabled
crabik_slot_esp32_s3.menu.JTAGAdapter.default.build.copy_jtag_files=0
crabik_slot_esp32_s3.menu.JTAGAdapter.builtin=Integrated USB JTAG
crabik_slot_esp32_s3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
crabik_slot_esp32_s3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1

crabik_slot_esp32_s3.menu.LoopCore.1=Core 1
crabik_slot_esp32_s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
crabik_slot_esp32_s3.menu.LoopCore.0=Core 0
crabik_slot_esp32_s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

crabik_slot_esp32_s3.menu.EventsCore.1=Core 1
crabik_slot_esp32_s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
crabik_slot_esp32_s3.menu.EventsCore.0=Core 0
crabik_slot_esp32_s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

crabik_slot_esp32_s3.menu.CDCOnBoot.default=Enabled (Requires Hardware CDC and JTAG Mode)
crabik_slot_esp32_s3.menu.CDCOnBoot.default.build.cdc_on_boot=1
crabik_slot_esp32_s3.menu.CDCOnBoot.discdc=Disabled
crabik_slot_esp32_s3.menu.CDCOnBoot.discdc.build.cdc_on_boot=0

crabik_slot_esp32_s3.menu.MSCOnBoot.default=Disabled
crabik_slot_esp32_s3.menu.MSCOnBoot.default.build.msc_on_boot=0
crabik_slot_esp32_s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
crabik_slot_esp32_s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

crabik_slot_esp32_s3.menu.USBMode.default=Hardware CDC and JTAG
crabik_slot_esp32_s3.menu.USBMode.default.build.usb_mode=1
crabik_slot_esp32_s3.menu.USBMode.default.build.cdc_on_boot=1
crabik_slot_esp32_s3.menu.USBMode.usbotg=USB-OTG
crabik_slot_esp32_s3.menu.USBMode.usbotg.build.usb_mode=0
crabik_slot_esp32_s3.menu.USBMode.usbotg.build.cdc_on_boot=0

crabik_slot_esp32_s3.menu.UploadMode.default=UART0 / Hardware CDC
crabik_slot_esp32_s3.menu.UploadMode.default.upload.use_1200bps_touch=false
crabik_slot_esp32_s3.menu.UploadMode.default.upload.wait_for_upload_port=false
crabik_slot_esp32_s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
crabik_slot_esp32_s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
crabik_slot_esp32_s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

crabik_slot_esp32_s3.menu.CPUFreq.240=240MHz (WiFi)
crabik_slot_esp32_s3.menu.CPUFreq.240.build.f_cpu=240000000L
crabik_slot_esp32_s3.menu.CPUFreq.160=160MHz (WiFi)
crabik_slot_esp32_s3.menu.CPUFreq.160.build.f_cpu=160000000L
crabik_slot_esp32_s3.menu.CPUFreq.80=80MHz (WiFi)
crabik_slot_esp32_s3.menu.CPUFreq.80.build.f_cpu=80000000L

crabik_slot_esp32_s3.menu.PartitionScheme.default=8M Flash (3MB APP/1.5MB FATFS)
crabik_slot_esp32_s3.menu.PartitionScheme.default.build.partitions=default_8MB
crabik_slot_esp32_s3.menu.PartitionScheme.default.upload.maximum_size=3342336
crabik_slot_esp32_s3.menu.PartitionScheme.default_4MB=4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
crabik_slot_esp32_s3.menu.PartitionScheme.default_4MB.build.partitions=default
crabik_slot_esp32_s3.menu.PartitionScheme.defaultffat=4MB with ffat (1.2MB APP/1.5MB FATFS)
crabik_slot_esp32_s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
crabik_slot_esp32_s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
crabik_slot_esp32_s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
crabik_slot_esp32_s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
crabik_slot_esp32_s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
crabik_slot_esp32_s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
crabik_slot_esp32_s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
crabik_slot_esp32_s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
crabik_slot_esp32_s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
crabik_slot_esp32_s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
crabik_slot_esp32_s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
crabik_slot_esp32_s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
crabik_slot_esp32_s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576

crabik_slot_esp32_s3.menu.UploadSpeed.921600=921600
crabik_slot_esp32_s3.menu.UploadSpeed.921600.upload.speed=921600
crabik_slot_esp32_s3.menu.UploadSpeed.115200=115200
crabik_slot_esp32_s3.menu.UploadSpeed.115200.upload.speed=115200
crabik_slot_esp32_s3.menu.UploadSpeed.256000.windows=256000
crabik_slot_esp32_s3.menu.UploadSpeed.256000.upload.speed=256000
crabik_slot_esp32_s3.menu.UploadSpeed.230400.windows.upload.speed=256000
crabik_slot_esp32_s3.menu.UploadSpeed.230400=230400
crabik_slot_esp32_s3.menu.UploadSpeed.230400.upload.speed=230400
crabik_slot_esp32_s3.menu.UploadSpeed.460800.linux=460800
crabik_slot_esp32_s3.menu.UploadSpeed.460800.macosx=460800
crabik_slot_esp32_s3.menu.UploadSpeed.460800.upload.speed=460800
crabik_slot_esp32_s3.menu.UploadSpeed.512000.windows=512000
crabik_slot_esp32_s3.menu.UploadSpeed.512000.upload.speed=512000

crabik_slot_esp32_s3.menu.DebugLevel.none=None
crabik_slot_esp32_s3.menu.DebugLevel.none.build.code_debug=0
crabik_slot_esp32_s3.menu.DebugLevel.error=Error
crabik_slot_esp32_s3.menu.DebugLevel.error.build.code_debug=1
crabik_slot_esp32_s3.menu.DebugLevel.warn=Warn
crabik_slot_esp32_s3.menu.DebugLevel.warn.build.code_debug=2
crabik_slot_esp32_s3.menu.DebugLevel.info=Info
crabik_slot_esp32_s3.menu.DebugLevel.info.build.code_debug=3
crabik_slot_esp32_s3.menu.DebugLevel.debug=Debug
crabik_slot_esp32_s3.menu.DebugLevel.debug.build.code_debug=4
crabik_slot_esp32_s3.menu.DebugLevel.verbose=Verbose
crabik_slot_esp32_s3.menu.DebugLevel.verbose.build.code_debug=5

crabik_slot_esp32_s3.menu.EraseFlash.none=Disabled
crabik_slot_esp32_s3.menu.EraseFlash.none.upload.erase_cmd=
crabik_slot_esp32_s3.menu.EraseFlash.all=Enabled
crabik_slot_esp32_s3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
